#### GetLocation Method

---

|  |
| --- |
| FamilyPointLocation Class   See Also |

Gets the location of the point.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public Transform GetLocation() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLocation As Transform ``` |

| Visual C++ |
| --- |
| ``` public: Transform^ GetLocation() ``` |

#### Return Value

The location of the point.

# See Also

FamilyPointLocation Class

Autodesk.Revit.DB Namespace

#### RailingSystemFamilyHandrails Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Handrail 1"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RailingSystemFamilyHandrails { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailingSystemFamilyHandrails As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RailingSystemFamilyHandrails { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| ProjectLocationSetIterator Class   See Also |

Bring the iterator back to the start of the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

#### Implements

 IEnumerator Reset

# Remarks

The Reset method will return the iterator back to the start of the set in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

# See Also

ProjectLocationSetIterator Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| ElementArray Class   See Also |

Removes every element from the array, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

ElementArray Class

Autodesk.Revit.DB Namespace

#### PanelScheduleLoadClassInconsistency Property

---

|  |
| --- |
| BuiltInFailures ScheduleViewFailures Class   See Also |

You have one or more loads connected to this panel that are not displayed in the panel schedule. Add the load classification(s) to the associated template to report this information in the Loads Summary.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PanelScheduleLoadClassInconsistency { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PanelScheduleLoadClassInconsistency As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PanelScheduleLoadClassInconsistency { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ScheduleViewFailures Class

Autodesk.Revit.DB Namespace

#### WrappingAtInsertsParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Wrapping at Inserts"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WrappingAtInsertsParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WrappingAtInsertsParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WrappingAtInsertsParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| LightDistribution Class   See Also |

Releases all resources used by the  LightDistribution

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

LightDistribution Class

Autodesk.Revit.DB.Lighting Namespace

#### RbsHvacloadSkylightCoolingLoadParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Skylight Cooling Load"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsHvacloadSkylightCoolingLoadParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsHvacloadSkylightCoolingLoadParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsHvacloadSkylightCoolingLoadParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| GroupSet Class   See Also |

Removes every group from the set, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

GroupSet Class

Autodesk.Revit.DB Namespace

#### IsMechanicalAnalysisEnabled Property

---

|  |
| --- |
| Application Class   See Also |

Checks whether or not mechanical analysis is enabled, and enable or disable it.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsMechanicalAnalysisEnabled { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsMechanicalAnalysisEnabled As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsMechanicalAnalysisEnabled { 	bool get (); 	void set (bool value); } ``` |

# Remarks

Enabling mechanical analysis will not take effect unless the mechanical discipline is also enabled.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

# See Also

Application Class

Autodesk.Revit.ApplicationServices Namespace

#### LockedStartOffset Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Negative Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId LockedStartOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property LockedStartOffset As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ LockedStartOffset { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Transform1D Constructor (Double)

---

|  |
| --- |
| Transform1D Class   See Also |

Constructs the transformation by specifying the scale only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public Transform1D( 	double scale ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	scale As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: Transform1D( 	double scale ) ``` |

#### Parameters

scale
:   Type:  System Double
     The scale of the transformation.

# Remarks

The translation is set to zero. 1D space is tranformed according to the following formula: t --> scale\*t + translation This constructor sets translation to zero.

# See Also

Transform1D Class

Transform1D Overload

Autodesk.Revit.DB Namespace

#### HasCircuitsWithoutElectricalLoadAreas Method

---

|  |
| --- |
| ElectricalLoadAreaData Class   See Also |

Checks whether there are any empty plan circuits in which there are no electrical load areas.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public static bool HasCircuitsWithoutElectricalLoadAreas( 	Document doc, 	ElementId levelId, 	ElementId phaseId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function HasCircuitsWithoutElectricalLoadAreas ( _ 	doc As Document, _ 	levelId As ElementId, _ 	phaseId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool HasCircuitsWithoutElectricalLoadAreas( 	Document^ doc,  	ElementId^ levelId,  	ElementId^ phaseId ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The document to check.

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The base level on which the empty plan circuits to check.

phaseId
:   Type:  Autodesk.Revit.DB ElementId
     The associated phase in which the empty plan circuits to check.

#### Return Value

True if there are empty plan circuits in which there are no electrical load areas, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | doc is not a project document. -or- The ElementId levelId is not a Level. -or- The id does not represent a valid phase. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |

# See Also

ElectricalLoadAreaData Class

Autodesk.Revit.DB.Electrical Namespace

#### ProfileCrossesRevolutionAxis Property

---

|  |
| --- |
| BuiltInFailures RevolutionFailures Class   See Also |

The profile must not cross the axis of revolution.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ProfileCrossesRevolutionAxis { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ProfileCrossesRevolutionAxis As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ProfileCrossesRevolutionAxis { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RevolutionFailures Class

Autodesk.Revit.DB Namespace

#### NamingCategoryId Property

---

|  |
| --- |
| AssemblyInstance Class   See Also |

Id of the category that drives the default naming scheme for the assembly instance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementId NamingCategoryId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property NamingCategoryId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ NamingCategoryId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: This naming category was not valid for an assembly instance containing the proposed members. The naming category should match one of the member element categories. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

AssemblyInstance Class

Autodesk.Revit.DB Namespace

#### DockableFrameShown Property

---

|  |
| --- |
| DockableFrameVisibilityChangedEventArgs Class   See Also |

True if the pane is being shown, false if it is being hidden.

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool DockableFrameShown { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property DockableFrameShown As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool DockableFrameShown { 	bool get (); } ``` |

# See Also

DockableFrameVisibilityChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace

#### Dispose Method

---

|  |
| --- |
| FluidTemperatureSetIterator Class   See Also |

Releases all resources used by the  FluidTemperatureSetIterator

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

# See Also

FluidTemperatureSetIterator Class

Autodesk.Revit.DB.Plumbing Namespace

#### StructuralWallUsage Property

---

|  |
| --- |
| StructuralWallUsageFilter Class   See Also |

The wall structural usage.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public StructuralWallUsage StructuralWallUsage { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property StructuralWallUsage As StructuralWallUsage 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property StructuralWallUsage StructuralWallUsage { 	StructuralWallUsage get (); } ``` |

# See Also

StructuralWallUsageFilter Class

Autodesk.Revit.DB.Structure Namespace

#### KilonewtonsPerSquareMeter Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Kilonewtons per square meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KilonewtonsPerSquareMeter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KilonewtonsPerSquareMeter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KilonewtonsPerSquareMeter { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### Contains Method

---

|  |
| --- |
| CitySet Class   See Also |

Tests for the existence of a city within the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Contains( 	City item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Contains ( _ 	item As City _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Contains( 	City^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB City
     The city to be searched for.

#### Return Value

The Contains method returns True if the city is within the set, otherwise False.

# See Also

CitySet Class

Autodesk.Revit.DB Namespace

#### MinValue Property

---

|  |
| --- |
| VoltageType Class   See Also |

Get lower boundary of voltage value of this voltage definition, the unit is volt.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double MinValue { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MinValue As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double MinValue { 	double get (); } ``` |

# See Also

VoltageType Class

Autodesk.Revit.DB.Electrical Namespace

#### ThermalAsset Constructor

---

|  |
| --- |
| ThermalAsset Class   See Also |

Constructs an instance of ThermalAsset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ThermalAsset( 	string name, 	ThermalMaterialType materialType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	name As String, _ 	materialType As ThermalMaterialType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ThermalAsset( 	String^ name,  	ThermalMaterialType materialType ) ``` |

#### Parameters

name
:   Type:  System String
     The name of the asset.

materialType
:   Type:  Autodesk.Revit.DB ThermalMaterialType
     The type of thermal material that this asset will describe.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name is an empty string. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ThermalAsset Class

Autodesk.Revit.DB Namespace

#### Export Method (View)

---

|  |
| --- |
| CustomExporter Class   See Also |

Exports one 3D or 2D view

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void Export( 	View view ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Export ( _ 	view As View _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Export( 	View^ view ) ``` |

#### Parameters

view
:   Type:  Autodesk.Revit.DB View
     An instance of the view to export

# Remarks

Note that the actual export process may differ depending on the type of export context used. For example, when the  IModelExportContext  is used, Revit is likely to perform several rounds of traversing each view, which may result in invoking the OnViewBegin/OnViewEnd method multiple times for every one view. It is because Revit draws objects in several layers (model layer, annotation layer, etc.) and will traverse each layer individually. In the most common scenario the user will receive two invocations of OnViewBegin/OnViewEnd: In the first round, all model entities will be received, while in the second round all text annotation elements will be received, if any present in the given view.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The view is not exportable, such as a template view or wrong type view, for example. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The instance of IExportContext is not valid. -or- Rendering is currently not supported in the running instance of Revit. One reason for that to happen is that rendering and material libraries are not currently available. |

# See Also

CustomExporter Class

Export Overload

Autodesk.Revit.DB Namespace

#### DocumentSavedAs Event

---

|  |
| --- |
| ControlledApplication Class   See Also |

Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DocumentSavedAsEventArgs> DocumentSavedAs ``` |

| Visual Basic |
| --- |
| ``` Public Event DocumentSavedAs As EventHandler(Of DocumentSavedAsEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DocumentSavedAsEventArgs^>^ DocumentSavedAs { 	void add (EventHandler<DocumentSavedAsEventArgs^>^ value); 	void remove (EventHandler<DocumentSavedAsEventArgs^>^ value); } ``` |

# Remarks

This event is raised immediately after Revit has finished saving document with a new file name. Note that the first save of a newly created document will raise DocumentSavedAs rather than  DocumentSaved  event. It is raised even when document saving failed or was cancelled (during DocumentSavingAs event).

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Check the 'Status' property in event's argument to see whether the action itself was successful or not.

This event is not cancellable, for the process of saving document has already been finished.

The following API functions are not available for the current document during this event:

* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### HandleLoadResourceResults Method

---

|  |
| --- |
| IExternalResourceUIServer Interface   See Also |

Implement this method to display any UI related to messages or errors that result when the DB server associated with this UI server attempts to load an external resource.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` void HandleLoadResourceResults( 	Document document, 	IList<ExternalResourceLoadData> loadData ) ``` |

| Visual Basic |
| --- |
| ``` Sub HandleLoadResourceResults ( _ 	document As Document, _ 	loadData As IList(Of ExternalResourceLoadData) _ ) ``` |

| Visual C++ |
| --- |
| ``` void HandleLoadResourceResults( 	Document^ document,  	IList<ExternalResourceLoadData^>^ loadData ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document into which resources were loaded.

loadData
:   Type:  System.Collections.Generic IList   ExternalResourceLoadData
     A collection of ExternalResourceLoadData objects containing information about an attempt to load one or more external resources, including:

    * the load request Id
    * the type of resource that was loaded
    * information to identify the particular resource that was loaded
    * the actual content obtained during the load attempt
    * the context of the load operations, e.g. LoadOperationType::Explicit for an explicit loading, LoadOperationType::Automatic for an automatic loading
    * a settable property indicating whether the server reported any errors for the resource

    The ExternalResourceLoadData contains a property, ErrorsReported, which the server can use to indicate whether it handled any errors for the resource.

    For Revit links specifically, Revit will check this value to see if it should report errors about a given link in the Unresolved References dialog. An IExternalResourceUIServer can set this value to true to avoid redundant messages.

    Note that it is possible for Revit to encounter errors internally even if the server successfully provides a reference. In general, this value should only be set to true if the server has reported an error condition.

# Remarks

This method will be called automatically by Revit after the external resource load process is complete.

Note that automatic loads can occur in the context of other operations such as opening a file. During automatic loads, it is therefore recommended that the server only display UI that is critical for the user to see (such as error message).

The loading operation type is Explicit when the user is specifically trying to reload the resource. During explicit loads, it may be desirable to provide more feedback to the user, such as specific feedback that the load operation succeeded.

The loading operation type can be accessed through  ExternalResourceLoadContext  .

Note that providing messages and other UI feedback for Revit links is more complicated, because links can be nested. The UI server may wish to provide different messages and take different actions, depending on whether a link loaded from the DB server was a "top-level" link, or was nested. For example, while it may be possible to correct an error that occurred with a top-level link by loading it directly, this cannot be done with a nested link, as Revit will throw an exception.

To complicate things further, the same Revit document may appear more than once in a tree of nested links, and the UI server should avoid repeatedly posting the same message for instances of that document.

To help UI servers handle situations where a nested tree of links is loaded:

* Each UI server whose DB server loaded one or more links in the tree will only be called once.
* The collection of ExternalResourceLoadData objects passed into this method will include  *only those for links loaded by this server's DB server*  .
* The LinkLoadResults object contained in all ExternalResourceLoadData objects will always be the results for the  *top-level*  link, even if the top-level link was not loaded by this server's DB server. The LinkLoadResults class contains methods for navigating the full tree of load results (starting with the top node), so the UI server will be able to determine the complete context in which one of its DB server's resources was loaded.
* Servers should only report results for their own link, whether they are nested or not.

# See Also

IExternalResourceUIServer Interface

Autodesk.Revit.UI Namespace

#### Subcategory Property

---

|  |
| --- |
| ModelText Class   See Also |

The subcategory.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Category Subcategory { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Subcategory As Category 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Category^ Subcategory { 	Category^ get (); 	void set (Category^ value); } ``` |

# Remarks

The subcategory can be set to either the family category or one of its subcategories.

# See Also

ModelText Class

Autodesk.Revit.DB Namespace

#### ColumnTopAttachmentOffsetParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Offset From Attachment At Top"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ColumnTopAttachmentOffsetParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ColumnTopAttachmentOffsetParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ColumnTopAttachmentOffsetParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TextureVRepeat Property

---

|  |
| --- |
| Tile Class   See Also |

The property labeled "V Repeat" from the "Tile" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureVRepeat { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureVRepeat As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureVRepeat { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

Tile Class

Autodesk.Revit.DB.Visual Namespace

#### AddReferencePlane Method (Plane, BoundingBoxUV)

---

|  |
| --- |
| DirectShape Class   See Also |

Adds a reference plane to the DirectShape. The reference plane can either be bounded or unbounded.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public void AddReferencePlane( 	Plane refPlane, 	BoundingBoxUV boundingBoxUV ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddReferencePlane ( _ 	refPlane As Plane, _ 	boundingBoxUV As BoundingBoxUV _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddReferencePlane( 	Plane^ refPlane,  	BoundingBoxUV^ boundingBoxUV ) ``` |

#### Parameters

refPlane
:   Type:  Autodesk.Revit.DB Plane
     The geometry of the new reference plane.

boundingBoxUV
:   Type:  Autodesk.Revit.DB BoundingBoxUV
     If boundingBoxUV is set, the resulting reference plane that is added to the DirectShape will be displayed with those bounds. Note that the specified bounds must not be degenerate. If boundingBoxUV is not set, reasonable bounds are automatically calculated and applied to the input plane. The automatic bounds are based on the host direct shape's geometry.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | boundingBoxUV cannot be used as a BoundingBoxUV for the reference plane surface. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectShape Class

AddReferencePlane Overload

Autodesk.Revit.DB Namespace

#### FieldDelimiter Property

---

|  |
| --- |
| ViewScheduleExportOptions Class   See Also |

How to delimit fields. Default is Tab.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public string FieldDelimiter { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FieldDelimiter As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ FieldDelimiter { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ViewScheduleExportOptions Class

Autodesk.Revit.DB Namespace

#### RebarShapeDefinitionByArc Constructor (Document, Double, Double, Int32, Int32)

---

|  |
| --- |
| RebarShapeDefinitionByArc Class   See Also |

Create a spiral shape definition.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public RebarShapeDefinitionByArc( 	Document doc, 	double height, 	double pitch, 	int baseFinishingTurns, 	int topFinishingTurns ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	doc As Document, _ 	height As Double, _ 	pitch As Double, _ 	baseFinishingTurns As Integer, _ 	topFinishingTurns As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: RebarShapeDefinitionByArc( 	Document^ doc,  	double height,  	double pitch,  	int baseFinishingTurns,  	int topFinishingTurns ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document

height
:   Type:  System Double
     The height of the spiral (assuming the spiral is vertical).

pitch
:   Type:  System Double
     The pitch, or vertical distance traveled in one rotation.

baseFinishingTurns
:   Type:  System Int32
     The number of finishing turns at the lower end of the spiral.

topFinishingTurns
:   Type:  System Int32
     The number of finishing turns at the upper end of the spiral.

# Remarks

In order to create a spiral definition, you must provide default values for the spiral-specific parameters. Replaces RebarShape.NewDefinitionByArc() from prior versions.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | baseFinishingTurns is not between 0 and 100. -or- topFinishingTurns is not between 0 and 100. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given value for height must be greater than 0 and no more than 30000 feet. -or- The given value for pitch must be greater than 0 and no more than 30000 feet. |

# See Also

RebarShapeDefinitionByArc Class

RebarShapeDefinitionByArc Overload

Autodesk.Revit.DB.Structure Namespace

#### IsRectangular Method

---

|  |
| --- |
| CurveLoop Class   See Also |

Identifies if the curve loop is rectangular with respect to a given projection plane.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public bool IsRectangular( 	Plane plane ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsRectangular ( _ 	plane As Plane _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsRectangular( 	Plane^ plane ) ``` |

#### Parameters

plane
:   Type:  Autodesk.Revit.DB Plane
     The plane to which the curves will be projected to determine if they represent a rectangle.

#### Return Value

True if the curve loop is rectangular, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

CurveLoop Class

Autodesk.Revit.DB Namespace

#### RbsElecDistributionNodeSupplyFrom1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Supply From 1"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecDistributionNodeSupplyFrom1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecDistributionNodeSupplyFrom1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecDistributionNodeSupplyFrom1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotRemoveSubordFromGroupWarn Property

---

|  |
| --- |
| BuiltInFailures GroupFailures Class   See Also |

Element can't be removed or excluded from the Group because it is required by another Group element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotRemoveSubordFromGroupWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotRemoveSubordFromGroupWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotRemoveSubordFromGroupWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures GroupFailures Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ExtrusionAnalyzer Class   See Also |

Releases all resources used by the  ExtrusionAnalyzer

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ExtrusionAnalyzer Class

Autodesk.Revit.DB Namespace

#### RbsElecLoadsummaryDemandFactorRuleParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Description"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecLoadsummaryDemandFactorRuleParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecLoadsummaryDemandFactorRuleParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecLoadsummaryDemandFactorRuleParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsEmpty Property

---

|  |
| --- |
| CurveByPointsArray Class   See Also |

Test to see if the array is empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool IsEmpty { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property IsEmpty As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property bool IsEmpty { 	bool get (); } ``` |

# Remarks

If the array is empty then True will be returned, otherwise False.

# See Also

CurveByPointsArray Class

Autodesk.Revit.DB Namespace

#### ClearHandleConstraintPairHighlighting Method

---

|  |
| --- |
| RebarConstraintsManager Class   See Also |

Clears all highlighting in all views.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void ClearHandleConstraintPairHighlighting( 	Document aDoc ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ClearHandleConstraintPairHighlighting ( _ 	aDoc As Document _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ClearHandleConstraintPairHighlighting( 	Document^ aDoc ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document

# Remarks

If highlightHandleConstraintPairInAllViews has been called, then this method can be used to remove all highlighting.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace

#### BarTypeDiameterOptions Constructor

---

|  |
| --- |
| BarTypeDiameterOptions Class   See Also |

Constructs a new BarTypeDiameterOptions with default settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public BarTypeDiameterOptions() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: BarTypeDiameterOptions() ``` |

# See Also

BarTypeDiameterOptions Class

BarTypeDiameterOptions Overload

Autodesk.Revit.DB Namespace

#### OutdoorAirFlowStandard Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the possible outdoor airflow standard for a space type.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public enum OutdoorAirFlowStandard ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration OutdoorAirFlowStandard ``` |

| Visual C++ |
| --- |
| ``` public enum class OutdoorAirFlowStandard ``` |

# Members

| Member name | Description |
| --- | --- |
| ByPeopleAndByArea | By people and by area. |
| ByACH | By ACH. |
| MaxByPeople\_ByArea | Maximum(by people, by area). |
| MaxByACH\_ByPeopleByArea | Maximum(by ACH, by people and by area). |
| MaxByACH\_ByArea\_ByPeople | Maximum(by ACH, by area, by people). |

# See Also

Autodesk.Revit.DB.Analysis Namespace

#### ExtendBelowBaseGreaterThanRunTopElevation Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Extend Below Base needs to be less than Run Top Elevation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ExtendBelowBaseGreaterThanRunTopElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ExtendBelowBaseGreaterThanRunTopElevation As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ExtendBelowBaseGreaterThanRunTopElevation { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### TaskDialog Constructor

---

|  |
| --- |
| TaskDialog Class   See Also |

Creates a task dialog with title.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public TaskDialog( 	string title ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	title As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: TaskDialog( 	String^ title ) ``` |

#### Parameters

title
:   Type:  System String

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when title is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when title is an empty string. |

# See Also

TaskDialog Class

Autodesk.Revit.UI Namespace

#### BuiltInFailures.SlabShapeFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about SlabShape.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class SlabShapeFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class SlabShapeFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class SlabShapeFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures SlabShapeFailures

# See Also

BuiltInFailures SlabShapeFailures Members

Autodesk.Revit.DB Namespace

#### ViewShapeBuilder Constructor (DirectShapeTargetViewType)

---

|  |
| --- |
| ViewShapeBuilder Class   See Also |

A constructor for an ViewShapeBuilder object that takes a view type. It will infer the view normal from view type. View normal and view type are used to validate the geometry to be stored as a view-specific shape representation of a DirectShape object.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public ViewShapeBuilder( 	DirectShapeTargetViewType targetViewType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	targetViewType As DirectShapeTargetViewType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: ViewShapeBuilder( 	DirectShapeTargetViewType targetViewType ) ``` |

#### Parameters

targetViewType
:   Type:  Autodesk.Revit.DB DirectShapeTargetViewType
     View type for which this shape representation is intended. Currently limited to Plan Views.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | targetViewType is not DirectShapeTargetViewType::Plan |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ViewShapeBuilder Class

ViewShapeBuilder Overload

Autodesk.Revit.DB Namespace

#### IsValidFilledRegionTypeId Method

---

|  |
| --- |
| FilledRegion Class   See Also |

Indicates whether the given Id is a valid filled region type Id.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static bool IsValidFilledRegionTypeId( 	Document document, 	ElementId typeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidFilledRegionTypeId ( _ 	document As Document, _ 	typeId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidFilledRegionTypeId( 	Document^ document,  	ElementId^ typeId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

typeId
:   Type:  Autodesk.Revit.DB ElementId
     The filled region type Id.

#### Return Value

True if it is a valid filled region type Id, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FilledRegion Class

Autodesk.Revit.DB Namespace

#### ForegroundPatternId Property

---

|  |
| --- |
| FilledRegionType Class   See Also |

The foreground fill pattern Id.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public ElementId ForegroundPatternId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ForegroundPatternId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ForegroundPatternId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Remarks

When the FilledRegionAttributes element is in a family then the FillPattern used for a foreground pattern must have a 'Drafting' target.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The element id must represent a valid FillPatternElement. -or- When setting this property: The FillPattern target must be a drafting pattern. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

FilledRegionType Class

Autodesk.Revit.DB Namespace

#### SpotSlopeReferencePointIsSingular Property

---

|  |
| --- |
| BuiltInFailures DimensionFailures Class   See Also |

The highlighted Spot Slope references an element point that is singular.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SpotSlopeReferencePointIsSingular { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpotSlopeReferencePointIsSingular As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SpotSlopeReferencePointIsSingular { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures DimensionFailures Class

Autodesk.Revit.DB Namespace

#### Extension Property

---

|  |
| --- |
| ViewDisplaySketchyLines Class   See Also |

The extension scale value. Controls the magnitude of line's extension. Values between 0 and 10.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public int Extension { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Extension As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int Extension { 	int get (); 	void set (int value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The extension value is not valid. The valid range is 0 to 10. |

# See Also

ViewDisplaySketchyLines Class

Autodesk.Revit.DB Namespace

#### VisualLightTransmittance Property

---

|  |
| --- |
| FamilyThermalProperties Class   See Also |

The visual light transmittance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double VisualLightTransmittance { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property VisualLightTransmittance As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double VisualLightTransmittance { 	double get (); } ``` |

# See Also

FamilyThermalProperties Class

Autodesk.Revit.DB Namespace

#### StairsLandingtypeStructure Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Structure": Structure

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsLandingtypeStructure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsLandingtypeStructure As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsLandingtypeStructure { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### LightShapeStyle Enumeration

---

|  |
| --- |
| See Also |

Tags for specific light shape styles

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum LightShapeStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration LightShapeStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class LightShapeStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| Point | Point light shape. |
| Line | Line light shape. |
| Rectangle | Rectangular light shape. |
| Circle | Circular light shape. |

# See Also

Autodesk.Revit.DB.Lighting Namespace

#### Evaluate Method

---

|  |
| --- |
| EdgeEndPoint Class   See Also |

Evaluate the end point of the edge in 3d coordinates.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public XYZ Evaluate() ``` |

| Visual Basic |
| --- |
| ``` Public Function Evaluate As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ Evaluate() ``` |

#### Return Value

The end point of the edge in 3d coordinates.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Failed to evaluate the end point of the edge. |

# See Also

EdgeEndPoint Class

Autodesk.Revit.DB Namespace

#### ConditionType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the possible condition types for a space object.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ConditionType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ConditionType ``` |

| Visual C++ |
| --- |
| ``` public enum class ConditionType ``` |

# Members

| Member name | Description |
| --- | --- |
| Heated | Condition Type is Heated. |
| Cooled | Condition Type is Cooled. |
| HeatedAndCooled | Condition Type is HeatedAndCooled. |
| Unconditioned | Condition Type is Unconditioned. |
| Vented | Condition Type is Vented. |
| NaturallyVentedOnly | Condition Type is NaturallyVentedOnly. |
| NoOfConditionTypes | Condition Type is NoOfConditionTypes. |

# See Also

Autodesk.Revit.DB.Mechanical Namespace

#### DefaultJoinOption Property

---

|  |
| --- |
| ContinuousRailType Class   See Also |

The default join option between two rails.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public RailTypeDefaultJoinOption DefaultJoinOption { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DefaultJoinOption As RailTypeDefaultJoinOption 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property RailTypeDefaultJoinOption DefaultJoinOption { 	RailTypeDefaultJoinOption get (); 	void set (RailTypeDefaultJoinOption value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

ContinuousRailType Class

Autodesk.Revit.DB.Architecture Namespace

#### Transform Constructor

---

|  |
| --- |
| Transform Class   See Also |

The copy constructor.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Transform( 	Transform source ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	source As Transform _ ) ``` |

| Visual C++ |
| --- |
| ``` public: Transform( 	Transform^ source ) ``` |

#### Parameters

source
:   Type:  Autodesk.Revit.DB Transform

# See Also

Transform Class

Autodesk.Revit.DB Namespace

#### PlanViewCutPlaneHeight Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Cut Plane Height"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PlanViewCutPlaneHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PlanViewCutPlaneHeight As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PlanViewCutPlaneHeight { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ElectricalLoadClassificationSpace Enumeration

---

|  |
| --- |
| See Also |

This enum is used by the ElectricalLoadClassification to specify the load class for use with spaces.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public enum ElectricalLoadClassificationSpace ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ElectricalLoadClassificationSpace ``` |

| Visual C++ |
| --- |
| ``` public enum class ElectricalLoadClassificationSpace ``` |

# Members

| Member name | Description |
| --- | --- |
| None |  |
| Lighting |  |
| Power |  |

# See Also

Autodesk.Revit.DB.Electrical Namespace

#### AddHolesForTaps Property

---

|  |
| --- |
| FabricationSaveJobOptions Class   See Also |

Set true to have holes for taps on straights added to the created fabrication job.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 19.0.0.0 (19.0.0.405)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public bool AddHolesForTaps { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property AddHolesForTaps As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool AddHolesForTaps { 	bool get (); 	void set (bool value); } ``` |

# See Also

FabricationSaveJobOptions Class

Autodesk.Revit.DB.Fabrication Namespace

#### SteelElemHoleTappingHole Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Tapping hole"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemHoleTappingHole { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemHoleTappingHole As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemHoleTappingHole { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CannotPlaceFabricAreaWarn Property

---

|  |
| --- |
| BuiltInFailures FabricFailures Class   See Also |

Can't find a host for Fabric Area.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotPlaceFabricAreaWarn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotPlaceFabricAreaWarn As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotPlaceFabricAreaWarn { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FabricFailures Class

Autodesk.Revit.DB Namespace

#### TextOrientation Property

---

|  |
| --- |
| TableCellStyle Class   See Also |

The orientation of the cell (for vertical/horizontal text) with input in degrees multiplied by 10

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int TextOrientation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TextOrientation As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int TextOrientation { 	int get (); 	void set (int value); } ``` |

# See Also

TableCellStyle Class

Autodesk.Revit.DB Namespace

#### IsRevisionIssued Method

---

|  |
| --- |
| RevisionCloud Class   See Also |

Indicates whether the Revision associated with this RevisionCloud has been issued.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool IsRevisionIssued() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsRevisionIssued As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsRevisionIssued() ``` |

#### Return Value

True if the Revision has been issued, False otherwise.

# See Also

RevisionCloud Class

Autodesk.Revit.DB Namespace

#### DegreeFInterval Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol Â°F, indicating unit Fahrenheit interval.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DegreeFInterval { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DegreeFInterval As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DegreeFInterval { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### FailureMessage Constructor

---

|  |
| --- |
| FailureMessage Class   See Also |

Creates a new FailureMessage related to a given FailureDefinition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FailureMessage( 	FailureDefinitionId id ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	id As FailureDefinitionId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: FailureMessage( 	FailureDefinitionId^ id ) ``` |

#### Parameters

id
:   Type:  Autodesk.Revit.DB FailureDefinitionId
     Id of FailureDefinition.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | id is valid or does not have corresponding failure definition. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FailureMessage Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| LinkOperations Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

LinkOperations Class

Autodesk.Revit.DB Namespace

#### GUID Property

---

|  |
| --- |
| FamilyParameter Class   Example   See Also |

The globally unique identifier

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Guid GUID { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property GUID As Guid 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Guid GUID { 	Guid get (); } ``` |

# Examples

 Copy  C#

```
foreach (FamilyParameter familyParam in familyDoc.FamilyManager.Parameters)
{
    string familyParamName = familyParam.Definition.Name;
    try
    {
        Guid guid = familyParam.GUID;
        TaskDialog.Show("Revit",familyParamName + " is shared. Guid is " + guid);
    }
    catch (System.Exception)
    {
        TaskDialog.Show("Revit",familyParamName + " is NOT shared");
    }
}
```

 Copy  VB.NET

```
For Each familyParam As FamilyParameter In familyDoc.FamilyManager.Parameters
    Dim familyParamName As String = familyParam.Definition.Name
    Try
        Dim guid As Guid = familyParam.GUID
        TaskDialog.Show("Revit", familyParamName & " is shared. Guid is " & Convert.ToString(guid))
    Catch generatedExceptionName As System.Exception
        TaskDialog.Show("Revit", familyParamName & " is NOT shared")
    End Try
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the parameter is not a shared parameter. |

# See Also

FamilyParameter Class

Autodesk.Revit.DB Namespace

#### FbxLightBallastLoss Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Ballast Loss"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FbxLightBallastLoss { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FbxLightBallastLoss As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FbxLightBallastLoss { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetCellCategoryId Method (Int32)

---

|  |
| --- |
| TableSectionData Class   See Also |

Returns a column's ParamId Associated with the paramId to find the correct element

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementId GetCellCategoryId( 	int nCol ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCellCategoryId ( _ 	nCol As Integer _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetCellCategoryId( 	int nCol ) ``` |

#### Parameters

nCol
:   Type:  System Int32

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given column number nCol is invalid. |

# See Also

TableSectionData Class

GetCellCategoryId Overload

Autodesk.Revit.DB Namespace

#### Create Method (Document, String, ElementId, LoadCaseCategory)

---

|  |
| --- |
| LoadCase Class   Example   See Also |

Creates a new LoadCase.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static LoadCase Create( 	Document document, 	string name, 	ElementId natureId, 	LoadCaseCategory loadCaseCategory ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	name As String, _ 	natureId As ElementId, _ 	loadCaseCategory As LoadCaseCategory _ ) As LoadCase ``` |

| Visual C++ |
| --- |
| ``` public: static LoadCase^ Create( 	Document^ document,  	String^ name,  	ElementId^ natureId,  	LoadCaseCategory loadCaseCategory ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The Document to which new load case element will be added.

name
:   Type:  System String
     The name of the load case.

natureId
:   Type:  Autodesk.Revit.DB ElementId
     The load nature ID.

loadCaseCategory
:   Type:  Autodesk.Revit.DB.Structure LoadCaseCategory
     The predefined load case category.

#### Return Value

The newly created load case element if successful,    a null reference (  Nothing  in Visual Basic)  otherwise.

# Remarks

This method is designed to create LoadCase that is associated with one of the predefined category.

# Examples

 Copy  C#

```
#region Autodesk.Revit.DB.Structure.LoadUsage.Create(Autodesk.Revit.DB.Document,string)
#region Autodesk.Revit.DB.Structure.LoadComponent.#ctor(Autodesk.Revit.DB.ElementId,System.Double)
#region Autodesk.Revit.DB.Structure.LoadCombination.SetComponents(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.LoadComponent})
#region Autodesk.Revit.DB.Structure.LoadCombination.SetUsageIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
LoadCombination CreateLoadCombinationLoadCaseLoadUsageLoadNatureAndLoadComponent(Document document)
{
    // Create a new load combination
    LoadCombination loadCombination = LoadCombination.Create(document, "DL1 + RAIN1", LoadCombinationType.Combination, LoadCombinationState.Ultimate);
    if (loadCombination == null)
       throw new Exception("Create new load combination failed.");

    // Get all existing LoadCase
    FilteredElementCollector collector = new FilteredElementCollector(document);
    ICollection<Element> collection = collector.OfClass(typeof(LoadCase)).ToElements();

    // Find LoadCase "DL1"
    LoadCase case1 = null;
    foreach (Element e in collection)
    {
       LoadCase loadCase = e as LoadCase;
       if (loadCase.Name == "DL1")
       {
          case1 = loadCase;
          break;
       }
    }

    // Get all existing LoadNature
    collector = new FilteredElementCollector(document);
    collection = collector.OfClass(typeof(LoadNature)).ToElements();

    // Find LoadNature "Dead"
    LoadNature nature1 = null;
    foreach (Element e in collection)
    {
       LoadNature loadNature = e as LoadNature;
       if (loadNature.Name == "Dead")
       {
          nature1 = loadNature;
          break;
       }
    }

    // Create LoadNature "Dead" if not exist
    if (nature1 == null)
       nature1 = LoadNature.Create(document, "Dead");

    // Create LoadCase "DL1" if not exist
    if (case1 == null)
       case1 = LoadCase.Create(document, "DL1", nature1.Id, LoadCaseCategory.Dead);

    // Create LoadNature "Rain"
    LoadNature nature2 = LoadNature.Create(document, "Rain");
    if (nature2 == null)
       throw new Exception("Create new load nature failed.");

    // Create LoadCase "RAIN1"
    LoadCase case2 = LoadCase.Create(document, "RAIN1", nature2.Id, LoadCaseCategory.Snow);
    if (case1 == null || case2 == null)
       throw new Exception("Create new load case failed.");

    // Create LoadComponents - they consist of LoadCases or nested LoadCombination and Factors
    List<LoadComponent> components = new List<LoadComponent>();
    components.Add(new LoadComponent(case1.Id, 2.0));
    components.Add(new LoadComponent(case2.Id, 1.5));

    // Add components to combination
    loadCombination.SetComponents(components);

    // Create LoadUsages
    LoadUsage usage1 = LoadUsage.Create(document, "Frequent");
    LoadUsage usage2 = LoadUsage.Create(document, "Rare");

    if (usage1 == null || usage2 == null)
       throw new Exception("Create new load usage failed.");

    // Add load usages to combination
    loadCombination.SetUsageIds(new List<ElementId>() {usage1.Id, usage2.Id});

    // Give the user some information
    TaskDialog.Show("Revit", string.Format("Load Combination ID='{0}' created successfully.", loadCombination.Id.ToString()));

    return loadCombination;
}
#endregion
#endregion
#endregion
#endregion
```

 Copy  VB.NET

```
#Region "Autodesk.Revit.DB.Structure.LoadUsage.Create(Autodesk.Revit.DB.Document,string)"
#Region "Autodesk.Revit.DB.Structure.LoadComponent.#ctor(Autodesk.Revit.DB.ElementId,System.Double)"
#Region "Autodesk.Revit.DB.Structure.LoadCombination.SetComponents(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.LoadComponent})"
#Region "Autodesk.Revit.DB.Structure.LoadCombination.SetUsageIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})"
        Private Function CreateLoadCombinationLoadCaseLoadUsageLoadNatureAndLoadComponent(document As Document) As LoadCombination
            ' Create a new load combination
            Dim loadCombination__1 As LoadCombination = LoadCombination.Create(document, "DL1 + RAIN1", LoadCombinationType.Combination, LoadCombinationState.Ultimate)
            If loadCombination__1 Is Nothing Then
                Throw New Exception("Create new load combination failed.")
            End If

            ' Get all existing LoadCase
            Dim collector As New FilteredElementCollector(document)
            Dim collection As ICollection(Of Element) = collector.OfClass(GetType(LoadCase)).ToElements()

            ' Find LoadCase "DL1"
            Dim case1 As LoadCase = Nothing
            For Each e As Element In collection
                Dim loadCase__2 As LoadCase = TryCast(e, LoadCase)
                If loadCase__2.Name = "DL1" Then
                    case1 = loadCase__2
                    Exit For
                End If
            Next

            ' Get all existing LoadNature
            collector = New FilteredElementCollector(document)
            collection = collector.OfClass(GetType(LoadNature)).ToElements()

            ' Find LoadNature "Dead"
            Dim nature1 As LoadNature = Nothing
            For Each e As Element In collection
                Dim loadNature__3 As LoadNature = TryCast(e, LoadNature)
                If loadNature__3.Name = "Dead" Then
                    nature1 = loadNature__3
                    Exit For
                End If
            Next

            ' Create LoadNature "Dead" if not exist
            If nature1 Is Nothing Then
                nature1 = LoadNature.Create(document, "Dead")
            End If

            ' Create LoadCase "DL1" if not exist
            If case1 Is Nothing Then
                case1 = LoadCase.Create(document, "DL1", nature1.Id, LoadCaseCategory.Dead)
            End If

            ' Create LoadNature "Rain"
            Dim nature2 As LoadNature = LoadNature.Create(document, "Rain")
            If nature2 Is Nothing Then
                Throw New Exception("Create new load nature failed.")
            End If

            ' Create LoadCase "RAIN1"
            Dim case2 As LoadCase = LoadCase.Create(document, "RAIN1", nature2.Id, LoadCaseCategory.Snow)
            If case1 Is Nothing OrElse case2 Is Nothing Then
                Throw New Exception("Create new load case failed.")
            End If

            ' Create LoadComponents - they consist of LoadCases or nested LoadCombination and Factors
            Dim components As New List(Of LoadComponent)()
            components.Add(New LoadComponent(case1.Id, 2.0))
            components.Add(New LoadComponent(case2.Id, 1.5))

            ' Add components to combination
            loadCombination__1.SetComponents(components)

            ' Create LoadUsages
            Dim usage1 As LoadUsage = LoadUsage.Create(document, "Frequent")
            Dim usage2 As LoadUsage = LoadUsage.Create(document, "Rare")

            If usage1 Is Nothing OrElse usage2 Is Nothing Then
                Throw New Exception("Create new load usage failed.")
            End If

            ' Add load usages to combination
            loadCombination__1.SetUsageIds(New List(Of ElementId)() From {
                usage1.Id,
                usage2.Id
            })

            ' Give the user some information
            TaskDialog.Show("Revit", String.Format("Load Combination ID='{0}' created successfully.", loadCombination__1.Id.ToString()))

            Return loadCombination__1
        End Function
#End Region
#End Region
#End Region
#End Region
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given name is not unique. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

LoadCase Class

Create Overload

Autodesk.Revit.DB.Structure Namespace

#### IFCExporterService Property

---

|  |
| --- |
| ExternalServices BuiltInExternalServices Class   See Also |

The external service which permits registration of an alternate implementation for IFC export.

**Namespace:**   Autodesk.Revit.DB.ExternalService
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static ExternalServiceId IFCExporterService { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property IFCExporterService As ExternalServiceId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ExternalServiceId^ IFCExporterService { 	ExternalServiceId^ get (); } ``` |

# See Also

ExternalServices BuiltInExternalServices Class

Autodesk.Revit.DB.ExternalService Namespace

#### BuiltInFailures.WorksharingFailures Class

---

|  |
| --- |
| BuiltInFailures Class   Members   See Also |

Failures about WorksharingFailures.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class WorksharingFailures ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class WorksharingFailures ``` |

| Visual C++ |
| --- |
| ``` public ref class WorksharingFailures abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB BuiltInFailures WorksharingFailures

# See Also

BuiltInFailures WorksharingFailures Members

Autodesk.Revit.DB Namespace

#### ViewSolarstudySingledayPresetIndex Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Single day presets combo"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewSolarstudySingledayPresetIndex { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewSolarstudySingledayPresetIndex As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewSolarstudySingledayPresetIndex { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TypeId Property

---

|  |
| --- |
| AlignmentStationLabelSetOptions Class   See Also |

Specifies the ElementId of the labels' type. The default value is InvalidElementId. in this case,  CreateSet(Alignment, View, AlignmentStationLabelSetOptions)  will throw an exception.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public ElementId TypeId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TypeId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ TypeId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Remarks

Recommended types can be found using  IsRecommendedTypeForSet(Element)  Other valid types can be found using  IsValidType(Element)  .

# See Also

AlignmentStationLabelSetOptions Class

Autodesk.Revit.DB.Infrastructure Namespace

#### Create Method

---

|  |
| --- |
| MEPAnalyticalConnectionType Class   See Also |

Creates an analytical connection type element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static MEPAnalyticalConnectionType Create( 	Document doc, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	doc As Document, _ 	name As String _ ) As MEPAnalyticalConnectionType ``` |

| Visual C++ |
| --- |
| ``` public: static MEPAnalyticalConnectionType^ Create( 	Document^ doc,  	String^ name ) ``` |

#### Parameters

doc
:   Type:  Autodesk.Revit.DB Document
     The document.

name
:   Type:  System String
     The name of the analytical type to be created.

#### Return Value

The created analytical connection type element.

# Remarks

The newly created type would have the default pressure loss being 0. Use ElementType.duplicate to copy from any existing type.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | This name is already used by an existing analytical connection type in the document. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- name is an empty string. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MEPAnalyticalConnectionType Class

Autodesk.Revit.DB Namespace

#### FieldDomainPoints Class

---

|  |
| --- |
| Members   See Also |

Abstract base class for various classes of field domain points

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class FieldDomainPoints : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class FieldDomainPoints _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class FieldDomainPoints : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Analysis FieldDomainPoints
  Autodesk.Revit.DB.Analysis FieldDomainPointsByParameter
  Autodesk.Revit.DB.Analysis FieldDomainPointsByUV
  Autodesk.Revit.DB.Analysis FieldDomainPointsByXYZ

# See Also

FieldDomainPoints Members

Autodesk.Revit.DB.Analysis Namespace

#### ZoneEquipmentHvacType Enumeration

---

|  |
| --- |
| See Also |

The type of zone equipment.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum ZoneEquipmentHvacType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ZoneEquipmentHvacType ``` |

| Visual C++ |
| --- |
| ``` public enum class ZoneEquipmentHvacType ``` |

# Members

| Member name | Description |
| --- | --- |
| Undefined |  |
| ChilledBeamActive |  |
| FourPipeFanCoil |  |
| PackagedTerminalAirConditioner |  |
| PackagedTerminalHeatPump |  |
| ParallelFanPoweredBox |  |
| VAVBox |  |
| CAVBox |  |
| RadiantPanel |  |
| SeriesFanPoweredBox |  |
| UnitHeater |  |
| UnitVentilator |  |
| WaterSourceHeatPump |  |
| ChilledBeamPassive |  |
| Unconditioned |  |
| VRFFanCoil |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace

#### OpeningPartiallyCutsHost Property

---

|  |
| --- |
| BuiltInFailures OpeningFailures Class   See Also |

Opening partially cuts its host.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId OpeningPartiallyCutsHost { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property OpeningPartiallyCutsHost As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ OpeningPartiallyCutsHost { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures OpeningFailures Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| ViewShapeBuilder Class   See Also |

Clears the accumulated geometry and resets other ViewShapeBuilder parameters to invalid values.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: void Reset() ``` |

# See Also

ViewShapeBuilder Class

Autodesk.Revit.DB Namespace

#### CreateEqualsRule Method (ElementId, Double, Double)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether double-precision values from the document equal a certain value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateEqualsRule( 	ElementId parameter, 	double value, 	double epsilon ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateEqualsRule ( _ 	parameter As ElementId, _ 	value As Double, _ 	epsilon As Double _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateEqualsRule( 	ElementId^ parameter,  	double value,  	double epsilon ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     A double-typed parameter used to get values from the document for a given element.

value
:   Type:  System Double
     The user-supplied value against which values from the document will be compared.

epsilon
:   Type:  System Double
     Defines the tolerance within which two values may be considered equal.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given value for value is not finite -or- The given value for value is not a number -or- The given value for epsilon is not finite -or- The given value for epsilon is not a number |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateEqualsRule Overload

Autodesk.Revit.DB Namespace

#### RbsWireNeutralMultiplierParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Neutral Multiplier"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsWireNeutralMultiplierParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsWireNeutralMultiplierParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsWireNeutralMultiplierParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetCoincidentMassZoneFaceReferences Method

---

|  |
| --- |
| MassEnergyAnalyticalModel Class   See Also |

Returns References to Faces from MassZones coincident with an input Face from a MassEnergyAnalyticalModel.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static IList<Reference> GetCoincidentMassZoneFaceReferences( 	Document document, 	Reference referenceToFace ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetCoincidentMassZoneFaceReferences ( _ 	document As Document, _ 	referenceToFace As Reference _ ) As IList(Of Reference) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<Reference^>^ GetCoincidentMassZoneFaceReferences( 	Document^ document,  	Reference^ referenceToFace ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The Document.

referenceToFace
:   Type:  Autodesk.Revit.DB Reference
     A Reference to a Face of a MassEnergyAnalyticalModel.

#### Return Value

Returns References to Faces from MassZones coincident with an input Face from a MassEnergyAnalyticalModel.

# Remarks

The results are always References to Faces. The Reference Type should report as REFERENCE\_TYPE\_SURFACE. Currently Revit improperly reports it as REFERENCE\_TYPE\_NONE.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The Reference is not a Face of a MassEnergyAnalyticalModel. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MassEnergyAnalyticalModel Class

Autodesk.Revit.DB.Analysis Namespace

#### IntersectWith Method

---

|  |
| --- |
| FilteredElementCollector Class   See Also |

Intersects the set of elements passing the filter in this collector with the set of elements passing the filter in another collector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public FilteredElementCollector IntersectWith( 	FilteredElementCollector other ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IntersectWith ( _ 	other As FilteredElementCollector _ ) As FilteredElementCollector ``` |

| Visual C++ |
| --- |
| ``` public: FilteredElementCollector^ IntersectWith( 	FilteredElementCollector^ other ) ``` |

#### Parameters

other
:   Type:  Autodesk.Revit.DB FilteredElementCollector
     The other collector

#### Return Value

A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.

# Remarks

The result will be the same as using a LogicalAndFilter to connect this filter with another. If you have an active iterator to this collector it will be stopped by this call.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | The collector does not have a filter applied. Extraction or iteration of elements is not permitted without a filter. |

# See Also

FilteredElementCollector Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| FabricReinSpanSymbol Class   See Also |

Places a new instance of the Structural Fabric Reinforcement Symbol into the project relative to a particular FabricSheet and View.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static FabricReinSpanSymbol Create( 	Document document, 	ElementId viewId, 	LinkElementId hostId, 	XYZ point, 	ElementId symbolId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	viewId As ElementId, _ 	hostId As LinkElementId, _ 	point As XYZ, _ 	symbolId As ElementId _ ) As FabricReinSpanSymbol ``` |

| Visual C++ |
| --- |
| ``` public: static FabricReinSpanSymbol^ Create( 	Document^ document,  	ElementId^ viewId,  	LinkElementId^ hostId,  	XYZ^ point,  	ElementId^ symbolId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

viewId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the view in which the symbol should appear.

hostId
:   Type:  Autodesk.Revit.DB LinkElementId
     The ElementId of FabricSheet (either in the document, or linked from another document).

point
:   Type:  Autodesk.Revit.DB XYZ
     The span symbol's head position.

symbolId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the family symbol of this symbol.

#### Return Value

A reference to the newly-created symbol.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | hostId should refer to a FabricSheet element. -or- viewId does not refer to a valid view type for FabricReinSpanSymbol - only floor plan, reflected ceiling plans and elevations are permitted. -or- symbolId should refer to a FamilySymbol of category OST\_FabricReinSpanSymbol. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also

FabricReinSpanSymbol Class

Autodesk.Revit.DB.Structure Namespace

#### Unlimited Property

---

|  |
| --- |
| PlanViewRange Class   See Also |

View range is unlimited

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static ElementId Unlimited { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Unlimited As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ElementId^ Unlimited { 	ElementId^ get (); } ``` |

# See Also

PlanViewRange Class

Autodesk.Revit.DB Namespace

#### ServiceName Property

---

|  |
| --- |
| FabricationPart Class   See Also |

The name of the service associated with the fabrication part.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public string ServiceName { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ServiceName As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ ServiceName { 	String^ get (); } ``` |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### LightingFixture Class

---

|  |
| --- |
| Members   See Also |

Provides access to the Lighting Fixture in Autodesk Revit MEP.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class LightingFixture : MEPModel ``` |

| Visual Basic |
| --- |
| ``` Public Class LightingFixture _ 	Inherits MEPModel ``` |

| Visual C++ |
| --- |
| ``` public ref class LightingFixture : public MEPModel ``` |

# Remarks

The Lighting Fixture object can only be queried in Autodesk Revit MEP.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB MEPModel
  Autodesk.Revit.DB.Electrical LightingFixture

# See Also

LightingFixture Members

Autodesk.Revit.DB.Electrical Namespace

#### GetLineWeight Method

---

|  |
| --- |
| Category Class   See Also |

Retrieves the line weight assigned to the category for the given graphics style type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Nullable<int> GetLineWeight( 	GraphicsStyleType graphicsStyleType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLineWeight ( _ 	graphicsStyleType As GraphicsStyleType _ ) As Nullable(Of Integer) ``` |

| Visual C++ |
| --- |
| ``` public: Nullable<int> GetLineWeight( 	GraphicsStyleType graphicsStyleType ) ``` |

#### Parameters

graphicsStyleType
:   Type:  Autodesk.Revit.DB GraphicsStyleType
     The type of graphics style.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | Thrown when the input argument-"graphicsStyleType"-is out of range. |

# See Also

Category Class

Autodesk.Revit.DB Namespace

#### StairstypeNotchHorizontalGap Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Horizontal Gap Distance":

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairstypeNotchHorizontalGap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairstypeNotchHorizontalGap As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairstypeNotchHorizontalGap { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Document Property

---

|  |
| --- |
| ImporterIFC Class   See Also |

Gets the document associated with the import.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public Document Document { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Document As Document 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Document^ Document { 	Document^ get (); } ``` |

# See Also

ImporterIFC Class

Autodesk.Revit.DB.IFC Namespace

#### ViewerCropRegion Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Crop View"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ViewerCropRegion { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ViewerCropRegion As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ViewerCropRegion { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ExportLineweightKey Class

---

|  |
| --- |
| Members   See Also |

A key used to represent an item stored in an  ExportLineweightTable  .

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public class ExportLineweightKey : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ExportLineweightKey _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ExportLineweightKey : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExportLineweightKey

# See Also

ExportLineweightKey Members

Autodesk.Revit.DB Namespace

#### IncludeLastBar Property

---

|  |
| --- |
| Rebar Class   See Also |

Identifies if the last bar in rebar set is shown.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2009

# Syntax

| C# |
| --- |
| ``` public bool IncludeLastBar { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IncludeLastBar As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IncludeLastBar { 	bool get (); 	void set (bool value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

# See Also

Rebar Class

Autodesk.Revit.DB.Structure Namespace

#### WhitePoint Property

---

|  |
| --- |
| RenderingImageExposureSettings Class   See Also |

The white point value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double WhitePoint { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property WhitePoint As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double WhitePoint { 	double get (); 	void set (double value); } ``` |

# Remarks

Specify the white balance of the rendering(measured in Kelvin). Incandescent lighting:2800 K; Daylight 6500K.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The value of white point is not valid. The valid range is 1800 to 15000. |

# See Also

RenderingImageExposureSettings Class

Autodesk.Revit.DB Namespace

#### IsValidValue Method

---

|  |
| --- |
| AssetPropertyList Class   See Also |

Check that value is valid.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public bool IsValidValue( 	IList<AssetProperty> value ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidValue ( _ 	value As IList(Of AssetProperty) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidValue( 	IList<AssetProperty^>^ value ) ``` |

#### Parameters

value
:   Type:  System.Collections.Generic IList   AssetProperty
     The array of properties to validate.

#### Return Value

Returns true if the array of properties is valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Cannot check validity for a property not being edited in AppearanceAssetEditScope. |

# See Also

AssetPropertyList Class

Autodesk.Revit.DB.Visual Namespace

#### SetBorderAroundSchedule Method

---

|  |
| --- |
| PanelScheduleData Class   See Also |

Adds a border around the schedule

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetBorderAroundSchedule( 	ElementId borderId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetBorderAroundSchedule ( _ 	borderId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetBorderAroundSchedule( 	ElementId^ borderId ) ``` |

#### Parameters

borderId
:   Type:  Autodesk.Revit.DB ElementId
     The border to set around the schedule

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PanelScheduleData Class

Autodesk.Revit.DB.Electrical Namespace

#### InstanceProfileNotMatchWithHostError Property

---

|  |
| --- |
| BuiltInFailures MEPSupportFailures Class   See Also |

The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InstanceProfileNotMatchWithHostError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InstanceProfileNotMatchWithHostError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InstanceProfileNotMatchWithHostError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPSupportFailures Class

Autodesk.Revit.DB Namespace

#### ReferenceArrayIterator Class

---

|  |
| --- |
| Members   See Also |

An iterator to a reference array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public abstract class ReferenceArrayIterator : APIObject,  	IEnumerator ``` |

| Visual Basic |
| --- |
| ``` Public MustInherit Class ReferenceArrayIterator _ 	Inherits APIObject _ 	Implements IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public ref class ReferenceArrayIterator abstract : public APIObject,  	IEnumerator ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB ReferenceArrayIterator

# See Also

ReferenceArrayIterator Members

Autodesk.Revit.DB Namespace

#### WallMeetsRoofTangentially Property

---

|  |
| --- |
| BuiltInFailures WallJoinRoofFailures Class   See Also |

The highlighted wall cannot be joined to the highlighted roof because the wall meets the roof tangentially.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WallMeetsRoofTangentially { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallMeetsRoofTangentially As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WallMeetsRoofTangentially { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures WallJoinRoofFailures Class

Autodesk.Revit.DB Namespace

#### Kilojoules Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Kilojoules.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Kilojoules { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Kilojoules As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Kilojoules { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### RebarShapeStirrupTieAttachment Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Stirrup/Tie Attachment"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarShapeStirrupTieAttachment { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarShapeStirrupTieAttachment As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarShapeStirrupTieAttachment { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsDone Method

---

|  |
| --- |
| ComponentRepeaterIterator Class   See Also |

Identifies if the iteration has completed.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public virtual bool IsDone() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function IsDone As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool IsDone() ``` |

#### Return Value

True if the iteration has no more items. False if there are more items to be iterated.

# See Also

ComponentRepeaterIterator Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| LightType Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

LightType Class

Autodesk.Revit.DB.Lighting Namespace

#### StirrupTieBendDiameter Property

---

|  |
| --- |
| RebarBarType Class   See Also |

Defines bar and hook bend diameter for rebar whose style is stirrup/tie

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double StirrupTieBendDiameter { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property StirrupTieBendDiameter As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double StirrupTieBendDiameter { 	double get (); 	void set (double value); } ``` |

#### Field Value

The bar and hook bend diameter for rebar whose style is stirrup/tie

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: the bend diameter stirrupTieBendDiam isn't between bar diameter and 99.0 |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace

#### Common Property

---

|  |
| --- |
| DisciplineTypeId Class   See Also |

Common.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Common { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Common As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Common { 	ForgeTypeId^ get (); } ``` |

# See Also

DisciplineTypeId Class

Autodesk.Revit.DB Namespace

#### Lookup Method

---

|  |
| --- |
| FabricationPartType Class   See Also |

Looks up an existing fabrication part type based on a specfic fabrication service button and condition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public static ElementId Lookup( 	Document document, 	FabricationServiceButton button, 	int condition ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Lookup ( _ 	document As Document, _ 	button As FabricationServiceButton, _ 	condition As Integer _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ Lookup( 	Document^ document,  	FabricationServiceButton^ button,  	int condition ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

button
:   Type:  Autodesk.Revit.DB FabricationServiceButton
     The fabrication service button.

condition
:   Type:  System Int32
     The condition index.

#### Return Value

Identifier of the fabrication part type element or invalidElementId if no fabrication part type exist for the specific fabrication service button and condition

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | the index condition is not larger or equal to 0 and less than ConditionCount |

# See Also

FabricationPartType Class

Autodesk.Revit.DB Namespace

#### MoveNext Method

---

|  |
| --- |
| ElementArrayIterator Class   See Also |

Move the iterator one item forward.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool MoveNext() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function MoveNext As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool MoveNext() ``` |

#### Return Value

Returns True if the iterator was successfully moved forward one item and the Current property will return a valid item. False will be returned it the iterator has reached the end of the array.

#### Implements

 IEnumerator MoveNext

# Remarks

MoveNext must be called before the Current property is valid with a new or Reset iterator in line with the expected behavior of IEnumerator.

# See Also

ElementArrayIterator Class

Autodesk.Revit.DB Namespace

#### NoFittingInProjectError Property

---

|  |
| --- |
| BuiltInFailures AutoRouteFailures Class   See Also |

The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project. Ensure the fitting is loaded in the project and try again.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NoFittingInProjectError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NoFittingInProjectError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NoFittingInProjectError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoRouteFailures Class

Autodesk.Revit.DB Namespace

#### AnalyticalModelColumnTopExtension Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top x Projection"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalModelColumnTopExtension { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalModelColumnTopExtension As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalModelColumnTopExtension { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### MaterialParamTransparency Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Transparency"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MaterialParamTransparency { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MaterialParamTransparency As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MaterialParamTransparency { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### SetMinimumNumberOfDigits Method

---

|  |
| --- |
| NumberingSchema Class   See Also |

Sets a new value for the minimum number of digits to be used for formating the Number parameter of all numbered elements of the given document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static void SetMinimumNumberOfDigits( 	Document document, 	int value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub SetMinimumNumberOfDigits ( _ 	document As Document, _ 	value As Integer _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void SetMinimumNumberOfDigits( 	Document^ document,  	int value ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which the new value will be in applied.

value
:   Type:  System Int32
     New value for the minimum number of digits.

# Remarks

Valid values range from 1 to 10. Numbers with fewer digits than the minimum number will be padded with leading zeros.

The value affects all numbering schemas. Thus, once set, numbers for Rebar and Reinforcement Fabric will be formatted with the same minimum number of digits.

The current value can obtained by invoking the  GetMinimumNumberOfDigits(Document)  method.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The minimum number of digits must be in range from 1 to 10. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

NumberingSchema Class

Autodesk.Revit.DB Namespace

#### GetInapplicableParameters Method

---

|  |
| --- |
| ParameterFilterUtilities Class   See Also |

Returns the parameters that are not among the set of filterable parameters common to the given categories.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static IList<ElementId> GetInapplicableParameters( 	Document aDoc, 	ICollection<ElementId> categories, 	IList<ElementId> parameters ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetInapplicableParameters ( _ 	aDoc As Document, _ 	categories As ICollection(Of ElementId), _ 	parameters As IList(Of ElementId) _ ) As IList(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<ElementId^>^ GetInapplicableParameters( 	Document^ aDoc,  	ICollection<ElementId^>^ categories,  	IList<ElementId^>^ parameters ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     The document containing the categories and parameters to query.

categories
:   Type:  System.Collections.Generic ICollection   ElementId
     The categories that define the set of possibly filterable parameters.

parameters
:   Type:  System.Collections.Generic IList   ElementId
     The parameters desired for use in a parameter filter.

#### Return Value

A list of parameters from the given array that are not valid for use in a parameter filter with the given categories.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterUtilities Class

Autodesk.Revit.DB Namespace

#### FlexPipeType Property

---

|  |
| --- |
| FlexPipe Class   See Also |

The flex pipe type of this flex pipe.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FlexPipeType FlexPipeType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FlexPipeType As FlexPipeType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property FlexPipeType^ FlexPipeType { 	FlexPipeType^ get (); 	void set (FlexPipeType^ value); } ``` |

# See Also

FlexPipe Class

Autodesk.Revit.DB.Plumbing Namespace

#### CannotCutJoinedElement Property

---

|  |
| --- |
| BuiltInFailures CutFailures Class   See Also |

Can't cut joined element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCutJoinedElement { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCutJoinedElement As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCutJoinedElement { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CutFailures Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ExternalResourceLoadData Class   See Also |

Releases all resources used by the  ExternalResourceLoadData

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ExternalResourceLoadData Class

Autodesk.Revit.DB Namespace

#### GetAllDisciplines Method

---

|  |
| --- |
| UnitUtils Class   See Also |

Gets the identifiers of all available disciplines.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public static IList<ForgeTypeId> GetAllDisciplines() ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetAllDisciplines As IList(Of ForgeTypeId) ``` |

| Visual C++ |
| --- |
| ``` public: static IList<ForgeTypeId^>^ GetAllDisciplines() ``` |

#### Return Value

The discipline identifiers.

# See Also

UnitUtils Class

Autodesk.Revit.DB Namespace

#### GetEnumerator Method

---

|  |
| --- |
| ProjectLocationSet Class   See Also |

Retrieve a forward moving iterator to the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator^ GetEnumerator() ``` |

#### Return Value

Returns a forward moving iterator to the set.

#### Implements

 IEnumerable GetEnumerator

# See Also

ProjectLocationSet Class

Autodesk.Revit.DB Namespace

#### CurtainMullionn1 Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Grid 1 Mullions"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CurtainMullionn1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CurtainMullionn1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CurtainMullionn1 { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### GetPointIterator Method

---

|  |
| --- |
| PointCollection Class   See Also |

Creates and returns an iterator for the points contained in this collection.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public PointIterator GetPointIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetPointIterator As PointIterator ``` |

| Visual C++ |
| --- |
| ``` public: PointIterator^ GetPointIterator() ``` |

#### Return Value

New iterator created, make sure to call 'free' on it when finished using it.

# See Also

PointCollection Class

Autodesk.Revit.DB.PointClouds Namespace

#### StairsTreadsRisers Property

---

|  |
| --- |
| GroupTypeId Class   See Also |

"Threads/Risers"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsTreadsRisers { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsTreadsRisers As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsTreadsRisers { 	ForgeTypeId^ get (); } ``` |

# See Also

GroupTypeId Class

Autodesk.Revit.DB Namespace

#### SetColor Method

---

|  |
| --- |
| VertexPositionColored Class   See Also |

Sets the vertex's color.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetColor( 	ColorWithTransparency color ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetColor ( _ 	color As ColorWithTransparency _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetColor( 	ColorWithTransparency^ color ) ``` |

#### Parameters

color
:   Type:  Autodesk.Revit.DB ColorWithTransparency
     The vertex's color.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

VertexPositionColored Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### PipeFittingAndAccessoryPressureDropCalculatorNotAvailable Property

---

|  |
| --- |
| BuiltInFailures MEPCalculationFailures Class   See Also |

Pipe Fitting/Accessory Pressure Drop Calculator Not Available: [Calculator Name]

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PipeFittingAndAccessoryPressureDropCalculatorNotAvailable { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PipeFittingAndAccessoryPressureDropCalculatorNotAvailable As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PipeFittingAndAccessoryPressureDropCalculatorNotAvailable { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPCalculationFailures Class

Autodesk.Revit.DB Namespace

#### HasDoubleWallConnector Method

---

|  |
| --- |
| FabricationConnectorInfo Class   See Also |

Checks if there are any double wall connectors fabricated.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public bool HasDoubleWallConnector() ``` |

| Visual Basic |
| --- |
| ``` Public Function HasDoubleWallConnector As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasDoubleWallConnector() ``` |

#### Return Value

True if there are any double wall connectors fabricated.

# See Also

FabricationConnectorInfo Class

Autodesk.Revit.DB Namespace

#### CreateFromIFC Method

---

|  |
| --- |
| RevitLinkType Class   See Also |

Creates a new Revit link type from an existing Revit file created via import by reference of an asscoiated IFC file.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static LinkLoadResult CreateFromIFC( 	Document document, 	string ifcFilePath, 	string revitLinkedFilePath, 	bool recreateLink, 	RevitLinkOptions options ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateFromIFC ( _ 	document As Document, _ 	ifcFilePath As String, _ 	revitLinkedFilePath As String, _ 	recreateLink As Boolean, _ 	options As RevitLinkOptions _ ) As LinkLoadResult ``` |

| Visual C++ |
| --- |
| ``` public: static LinkLoadResult^ CreateFromIFC( 	Document^ document,  	String^ ifcFilePath,  	String^ revitLinkedFilePath,  	bool recreateLink,  	RevitLinkOptions^ options ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which to create the Revit link.

ifcFilePath
:   Type:  System String
     The path of the associated IFC file. This must be a full path.

revitLinkedFilePath
:   Type:  System String
     The path of the existing Revit file that contains elements created via an import by reference operation. This must be a full path.

recreateLink
:   Type:  System Boolean
     If true, the existing Revit file created via an import by reference operation will be updated based on the information in the IFC file. If false, the existing Revit file will be used as-is.

options
:   Type:  Autodesk.Revit.DB RevitLinkOptions
     An options class for loading Revit links.

#### Return Value

An object containing the results of creating and loading the Revit link type. It contains the ElementId of the new link.

# Remarks

This function is one of a series of steps necessary for linking an IFC file. To understand how it is used in context, please download the IFC open source code, and look in the Revit.IFC.Import project at Importer.ImportIFC(ImporterIFC importer), under the IFCImportAction.Link branch.

This function regenerates the input document. While the options argument allows specification of a path type, the input path argument must be a full path. Relative vs. absolute determines how Revit will store the path, but it needs a complete path to find the linked document initially.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | document is not a project document. -or- The input path "ifcFilePath" does not represent an IFC file. -or- document already contains a linked model at path revitLinkedFilePath. -or- The document is a cloud model. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions FileAccessException | The model cannot be accessed due to lack of access privileges. |
| Autodesk.Revit.Exceptions FileArgumentNotFoundException | There is not a valid Revit file at ifcFilePath's location -or- There is not a valid Revit file at revitLinkedFilePath's location |
| Autodesk.Revit.Exceptions InvalidOperationException | The file is not allowed to access. -or- Revit cannot customize worksets for this model. |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

RevitLinkType Class

CreateFromIFC Overload

Autodesk.Revit.DB Namespace

#### StructuralSectionIshapeWebthickness Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Web Thickness"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionIshapeWebthickness { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionIshapeWebthickness As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionIshapeWebthickness { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StairsNumberSystemReferenceOption Enumeration

---

|  |
| --- |
| See Also |

The reference types permitted for a number system to refer to the geometry of a stairs run.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum StairsNumberSystemReferenceOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration StairsNumberSystemReferenceOption ``` |

| Visual C++ |
| --- |
| ``` public enum class StairsNumberSystemReferenceOption ``` |

# Members

| Member name | Description |
| --- | --- |
| Center | The number system reference to stairs path. |
| Left | The number system reference to left boundary of stairs. |
| Right | The number system reference to right boundary of stairs. |
| LeftQuarter | The number system reference to left quarter of stairs |
| RightQuarter | The number system reference to right quarter of stairs |

# See Also

Autodesk.Revit.DB.Architecture Namespace

#### DoubleArrayIterator Constructor

---

|  |
| --- |
| DoubleArrayIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public DoubleArrayIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: DoubleArrayIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

DoubleArrayIterator Class

Autodesk.Revit.DB Namespace

#### ProfileCurveLoopCount Property

---

|  |
| --- |
| Form Class   See Also |

The number of curve loops in certain profile, specified by profile index.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public int this[ 	int index ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ProfileCurveLoopCount ( _ 	index As Integer _ ) As Integer 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property int ProfileCurveLoopCount[int index] { 	int get (int index); } ``` |

#### Parameters

index
:   Type:  System Int32
     Index to specify the profile, should be within 0 and (ProfileCount - 1).

# See Also

Form Class

Autodesk.Revit.DB Namespace

#### RbsElecPanelTotalestloadParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Total Estimated Demand"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPanelTotalestloadParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPanelTotalestloadParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPanelTotalestloadParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### WoodUseLatewoodBump Property

---

|  |
| --- |
| AdvancedWood Class   See Also |

The property labeled "Use latewood bump" from the "AdvancedWood" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string WoodUseLatewoodBump { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WoodUseLatewoodBump As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ WoodUseLatewoodBump { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace

#### CannotCreateOpenMiddleStringers Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Can't cut open/middle stringers geometry.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCreateOpenMiddleStringers { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCreateOpenMiddleStringers As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCreateOpenMiddleStringers { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### TextureRealWorldOffsetZ Property

---

|  |
| --- |
| Marble Class   See Also |

The property labeled "Offset Z" from the "Marble" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureRealWorldOffsetZ { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureRealWorldOffsetZ As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureRealWorldOffsetZ { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDistance".

# See Also

Marble Class

Autodesk.Revit.DB.Visual Namespace

#### Custom Property

---

|  |
| --- |
| MultipleValuesIndicationSettings Class   See Also |

If true,  CustomValue  is used as multiple values indication, otherwise a hardcoded standard value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public bool Custom { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Custom As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool Custom { 	bool get (); 	void set (bool value); } ``` |

# See Also

MultipleValuesIndicationSettings Class

Autodesk.Revit.DB Namespace

#### ExternalResourceTypes Class

---

|  |
| --- |
| See Also |

Provides a container of all Revit built-in ExternalResourceType instances.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static class ExternalResourceTypes ``` |

| Visual Basic |
| --- |
| ``` Public NotInheritable Class ExternalResourceTypes ``` |

| Visual C++ |
| --- |
| ``` public ref class ExternalResourceTypes abstract sealed ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ExternalResourceTypes

# See Also

Autodesk.Revit.DB Namespace

#### AutoPanel Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Curtain Panel"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AutoPanel { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AutoPanel As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AutoPanel { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StructuralSectionsServiceData Class

---

|  |
| --- |
| Members   See Also |

The data needed by section type server to perform type definition.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public class StructuralSectionsServiceData : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class StructuralSectionsServiceData _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class StructuralSectionsServiceData : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Structure StructuralSectionsServiceData

# See Also

StructuralSectionsServiceData Members

Autodesk.Revit.DB.Structure Namespace

#### SpecificHeat Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Specific Heat, in discipline Energy.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SpecificHeat { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SpecificHeat As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SpecificHeat { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| CameraInfo Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

CameraInfo Class

Autodesk.Revit.DB Namespace

#### IsDefaultFamilyTypeIdValid Method

---

|  |
| --- |
| Document Class   See Also |

Checks whether the family type id is valid for the give family category.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public bool IsDefaultFamilyTypeIdValid( 	ElementId familyCategoryId, 	ElementId familyTypeId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsDefaultFamilyTypeIdValid ( _ 	familyCategoryId As ElementId, _ 	familyTypeId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsDefaultFamilyTypeIdValid( 	ElementId^ familyCategoryId,  	ElementId^ familyTypeId ) ``` |

#### Parameters

familyCategoryId
:   Type:  Autodesk.Revit.DB ElementId
     The family category id.

familyTypeId
:   Type:  Autodesk.Revit.DB ElementId
     The default family type id.

#### Return Value

True if the family type id is valid for the give family category, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### CheckerSoften Property

---

|  |
| --- |
| Checker Class   See Also |

The property labeled "Soften" from the "Checker" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string CheckerSoften { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CheckerSoften As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ CheckerSoften { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 5".

# See Also

Checker Class

Autodesk.Revit.DB.Visual Namespace

#### GetDesignOptionId Method

---

|  |
| --- |
| ElementRecord Class   See Also |

Gets the design option id of the element record.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ElementId GetDesignOptionId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetDesignOptionId As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetDesignOptionId() ``` |

#### Return Value

The design option id.

# See Also

ElementRecord Class

Autodesk.Revit.DB Namespace

#### Element Property

---

|  |
| --- |
| Alignment Class   See Also |

The underlying  DirectShape  element.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public Element Element { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Element As Element 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Element^ Element { 	Element^ get (); } ``` |

# See Also

Alignment Class

Autodesk.Revit.DB.Infrastructure Namespace

#### RectangularDuctSizeSeparator Property

---

|  |
| --- |
| DuctSettings Class   See Also |

The rectangular duct size separator string.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public string RectangularDuctSizeSeparator { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RectangularDuctSizeSeparator As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ RectangularDuctSizeSeparator { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

DuctSettings Class

Autodesk.Revit.DB.Mechanical Namespace

#### UnpostFailure Method

---

|  |
| --- |
| Document Class   See Also |

Deletes the posted failure message associated with a given FailureMessageKey.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void UnpostFailure( 	FailureMessageKey messageKey ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub UnpostFailure ( _ 	messageKey As FailureMessageKey _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void UnpostFailure( 	FailureMessageKey^ messageKey ) ``` |

#### Parameters

messageKey
:   Type:  Autodesk.Revit.DB FailureMessageKey
     The key of the FailureMessage to be deleted.

# Remarks

If code that previously has posted a failure is executed again or otherwise detects that failure conditions do not exist anymore and the failure is not longer relevant, it should delete a failure message in order to let transaction to be committed. In order to delete the failure, it should invoke this method with a message key that was returned when the failure was posted.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | messageKey is invalid |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions ModificationOutsideTransactionException | The document has no open transaction. |

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### FilterStringRule Constructor (FilterableValueProvider, FilterStringRuleEvaluator, String)

---

|  |
| --- |
| FilterStringRule Class   See Also |

Constructs an instance of FilterStringRule.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2022

# Syntax

| C# |
| --- |
| ``` public FilterStringRule( 	FilterableValueProvider valueProvider, 	FilterStringRuleEvaluator evaluator, 	string ruleString ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	valueProvider As FilterableValueProvider, _ 	evaluator As FilterStringRuleEvaluator, _ 	ruleString As String _ ) ``` |

| Visual C++ |
| --- |
| ``` public: FilterStringRule( 	FilterableValueProvider^ valueProvider,  	FilterStringRuleEvaluator^ evaluator,  	String^ ruleString ) ``` |

#### Parameters

valueProvider
:   Type:  Autodesk.Revit.DB FilterableValueProvider
     A pointer to a "value provider" object that will extract values from a Revit document.

evaluator
:   Type:  Autodesk.Revit.DB FilterStringRuleEvaluator
     A pointer to the filter rule evaluator object that implements the desired test. The built-in evaluators implement commonly used tests for strings such as begins-with, ends-with, contains, equal, etc.

ruleString
:   Type:  System String
     The user-supplied string against which strings from a Revit document will be tested.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FilterStringRule Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| SlabShapeCreaseArray Class   See Also |

Removes every item from the array, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

SlabShapeCreaseArray Class

Autodesk.Revit.DB Namespace

#### IsDone Method

---

|  |
| --- |
| MacroModuleIterator Class   See Also |

Identifies if the iteration has completed.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPIMacros  (in RevitAPIMacros.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public virtual bool IsDone() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function IsDone As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool IsDone() ``` |

#### Return Value

True if the iteration has no more items. False if there are more items to be iterated.

# See Also

MacroModuleIterator Class

Autodesk.Revit.DB.Macros Namespace

#### BaseFinishingTurns Property

---

|  |
| --- |
| RebarShapeDrivenAccessor Class   See Also |

For a spiral, the number of finishing turns at the lower end of the spiral.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public int BaseFinishingTurns { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BaseFinishingTurns As Integer 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property int BaseFinishingTurns { 	int get (); 	void set (int value); } ``` |

# Remarks

Applies only to instances where RebarShape.Definition is of type RebarShapeDefinitionByArc, and its Type property is equal to the value RebarShapeDefinitionByArcType.Spiral.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: turns must be between 0 and 100. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidOperationException | This RebarShapeDrivenAccessor is not an instance of a spiral shape. -or- This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. |

# See Also

RebarShapeDrivenAccessor Class

Autodesk.Revit.DB.Structure Namespace

#### TemperatureRatingTypeSetIterator Constructor

---

|  |
| --- |
| TemperatureRatingTypeSetIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public TemperatureRatingTypeSetIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: TemperatureRatingTypeSetIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

TemperatureRatingTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### FormElemRegenSelfIntersectionResetConnections Property

---

|  |
| --- |
| BuiltInFailures FormFailures Class   See Also |

This form cannot be created due to self-intersecting geometry. Clicking the Reset Connections button will attempt to solve this problem.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FormElemRegenSelfIntersectionResetConnections { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FormElemRegenSelfIntersectionResetConnections As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FormElemRegenSelfIntersectionResetConnections { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures FormFailures Class

Autodesk.Revit.DB Namespace

#### ConnectPipePlaceholdersAtElbow Method (Document, Connector, Connector)

---

|  |
| --- |
| PlumbingUtils Class   See Also |

Connects placeholders that looks like elbow connection.

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool ConnectPipePlaceholdersAtElbow( 	Document document, 	Connector connector1, 	Connector connector2 ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ConnectPipePlaceholdersAtElbow ( _ 	document As Document, _ 	connector1 As Connector, _ 	connector2 As Connector _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool ConnectPipePlaceholdersAtElbow( 	Document^ document,  	Connector^ connector1,  	Connector^ connector2 ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

connector1
:   Type:  Autodesk.Revit.DB Connector
     The first end connector of placeholder to be connected to.

connector2
:   Type:  Autodesk.Revit.DB Connector
     The second end connector of placeholder to be connected to.

#### Return Value

True if connection succeeds, false otherwise.

# Remarks

The placeholders may have physical connection or may not connect at all. In the latter case, the first one connects to the end of second one. If connection fails, the placeholders cannot be physically connected.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The owner of connector is not pipe placeholder. -or- The owners of connectors belong to different types of system. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PlumbingUtils Class

ConnectPipePlaceholdersAtElbow Overload

Autodesk.Revit.DB.Plumbing Namespace

#### IsTranslation Property

---

|  |
| --- |
| Transform2D Class   See Also |

The boolean value that indicates whether this transformation is a translation.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public bool IsTranslation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsTranslation As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsTranslation { 	bool get (); } ``` |

# Remarks

This property is true if the only effect of transformation is translation. It checks that the linear part of the transform is identity. The translation vector may be zero (which would make this an identity transformation) or nonzero (which would make this a non-trivial translation).

# See Also

Transform2D Class

Autodesk.Revit.DB Namespace

#### CreateGreaterOrEqualRule Method (ElementId, Int32)

---

|  |
| --- |
| ParameterFilterRuleFactory Class   See Also |

Creates a filter rule that determines whether integer values from the document are greater than or equal to a certain value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static FilterRule CreateGreaterOrEqualRule( 	ElementId parameter, 	int value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateGreaterOrEqualRule ( _ 	parameter As ElementId, _ 	value As Integer _ ) As FilterRule ``` |

| Visual C++ |
| --- |
| ``` public: static FilterRule^ CreateGreaterOrEqualRule( 	ElementId^ parameter,  	int value ) ``` |

#### Parameters

parameter
:   Type:  Autodesk.Revit.DB ElementId
     An integer-typed parameter used to get values from the document for a given element.

value
:   Type:  System Int32
     The user-supplied value against which values from the document will be compared.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ParameterFilterRuleFactory Class

CreateGreaterOrEqualRule Overload

Autodesk.Revit.DB Namespace

#### AnalysisDisplayMarkersAndTextSettings Constructor

---

|  |
| --- |
| AnalysisDisplayMarkersAndTextSettings Class   See Also |

Constructs a default instance of markers and text settings.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public AnalysisDisplayMarkersAndTextSettings() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: AnalysisDisplayMarkersAndTextSettings() ``` |

# See Also

AnalysisDisplayMarkersAndTextSettings Class

AnalysisDisplayMarkersAndTextSettings Overload

Autodesk.Revit.DB.Analysis Namespace

#### WorksetHasChangedInCentralFile Property

---

|  |
| --- |
| BuiltInFailures EditingFailures Class   See Also |

This workset has changed in the Central Model. Please Reload Latest before making this workset editable.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId WorksetHasChangedInCentralFile { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WorksetHasChangedInCentralFile As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ WorksetHasChangedInCentralFile { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures EditingFailures Class

Autodesk.Revit.DB Namespace

#### ActualRiserHeightChanged Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

The actual riser height for one or more stairs violates the maximum set in the type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ActualRiserHeightChanged { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ActualRiserHeightChanged As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ActualRiserHeightChanged { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### Tf Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol Tf, indicating unit Tonnes force.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Tf { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Tf As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Tf { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### NumberSystem Class

---

|  |
| --- |
| Members   See Also |

An annotation that consists of a series of numeric tags attached to and describing a host element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class NumberSystem : Element ``` |

| Visual Basic |
| --- |
| ``` Public Class NumberSystem _ 	Inherits Element ``` |

| Visual C++ |
| --- |
| ``` public ref class NumberSystem : public Element ``` |

# Remarks

For a component-based stair, you can display tread/riser numbers for a run in plan, elevation, or section view. Sketch-based stair is not supported.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB NumberSystem

# See Also

NumberSystem Members

Autodesk.Revit.DB Namespace

#### StoneBumpAmount Property

---

|  |
| --- |
| Stone Class   See Also |

The property labeled "Amount" from the "Stone" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string StoneBumpAmount { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StoneBumpAmount As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ StoneBumpAmount { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyDouble" within the range of "0, 1".

# See Also

Stone Class

Autodesk.Revit.DB.Visual Namespace

#### StairsAttrRiserMaterial Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Riser Material"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsAttrRiserMaterial { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsAttrRiserMaterial As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsAttrRiserMaterial { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### FabricationLevelParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Reference Level"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricationLevelParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationLevelParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricationLevelParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidForSaveToProjectAsImage Method

---

|  |
| --- |
| ImageExportOptions Class   See Also |

Verify if ImageExportOptions object is valid for calling saveToProjectAsImage

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static bool IsValidForSaveToProjectAsImage( 	ImageExportOptions options, 	Document doc ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidForSaveToProjectAsImage ( _ 	options As ImageExportOptions, _ 	doc As Document _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidForSaveToProjectAsImage( 	ImageExportOptions^ options,  	Document^ doc ) ``` |

#### Parameters

options
:   Type:  Autodesk.Revit.DB ImageExportOptions
     ImageExportOptions object to be validated

doc
:   Type:  Autodesk.Revit.DB Document
     Document for view name verification

#### Return Value

True if ImageExportOptions object is valid for calling saveToProjectAsImage; false otherwise

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ImageExportOptions Class

Autodesk.Revit.DB Namespace

#### KipPerFt Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kip/ft, indicating unit Kips per foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KipPerFt { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KipPerFt As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KipPerFt { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### CfmPerFtSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol CFM/ftÂ², indicating unit Cubic feet per minute square foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId CfmPerFtSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CfmPerFtSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ CfmPerFtSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### EnergyAnalysisMasszoneDivideperimeter Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Perimeter Zone Division"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId EnergyAnalysisMasszoneDivideperimeter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property EnergyAnalysisMasszoneDivideperimeter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ EnergyAnalysisMasszoneDivideperimeter { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### YJustification Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"y Justification"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId YJustification { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property YJustification As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ YJustification { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Item Property

---

|  |
| --- |
| CategoryNameMap Class   See Also |

Gets or sets a category at a specified name within the map.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Category this[ 	string key ] { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Property Item ( _ 	key As String _ ) As Category 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Category^ Item[String^ key] { 	Category^ get (String^ key); 	void set (String^ key, Category^ value); } ``` |

#### Parameters

key
:   Type:  System String
     The name of the category to be set or retrieved.

#### Return Value

Returns the category at the specified name.

# See Also

CategoryNameMap Class

Autodesk.Revit.DB Namespace

#### Params Property

---

|  |
| --- |
| HermiteFace Class   See Also |

Parameters of the surface.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public DoubleArray this[ 	int index ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Params ( _ 	index As Integer _ ) As DoubleArray 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property DoubleArray^ Params[int index] { 	DoubleArray^ get (int index); } ``` |

#### Parameters

index
:   Type:  System Int32

# See Also

HermiteFace Class

Autodesk.Revit.DB Namespace

#### Fy Property

---

|  |
| --- |
| ReleaseConditions Class   See Also |

Gets or Sets the Fy of the release type.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public bool Fy { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Fy As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool Fy { 	bool get (); 	void set (bool value); } ``` |

# See Also

ReleaseConditions Class

Autodesk.Revit.DB.Structure Namespace

#### Current Property

---

|  |
| --- |
| AnalyticalEquipmentLoadData Class   See Also |

The current of the analytical equipment load.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public double Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Current As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Current { 	double get (); } ``` |

# See Also

AnalyticalEquipmentLoadData Class

Autodesk.Revit.DB.Electrical Namespace

#### InDashWgPer100ft Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol in-wg/100ft, indicating unit Inches of water (60 Â°F) per 100 feet.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId InDashWgPer100ft { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InDashWgPer100ft As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ InDashWgPer100ft { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### Room Property (Phase)

---

|  |
| --- |
| FamilyInstance Class   See Also |

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public Room this[ 	Phase phase ] { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Room ( _ 	phase As Phase _ ) As Room 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Room^ Room[Phase^ phase] { 	Room^ get (Phase^ phase); } ``` |

#### Parameters

phase
:   Type:  Autodesk.Revit.DB Phase

# See Also

FamilyInstance Class

Room Overload

Autodesk.Revit.DB Namespace

#### NotEnoughPointsInSurface Property

---

|  |
| --- |
| BuiltInFailures SiteFailures Class   See Also |

The surface must have at least three distinct Points.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId NotEnoughPointsInSurface { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property NotEnoughPointsInSurface As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ NotEnoughPointsInSurface { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SiteFailures Class

Autodesk.Revit.DB Namespace

#### DesignOption Property

---

|  |
| --- |
| Element Class   Example   See Also |

Returns the design option to which the element belongs.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public DesignOption DesignOption { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property DesignOption As DesignOption 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property DesignOption^ DesignOption { 	DesignOption^ get (); } ``` |

# Remarks

If the element is not in a design option, i.e. in the main model, then this property will return    a null reference (  Nothing  in Visual Basic)  .

# Examples

 Copy  C#

```
void Getinfo_DesignOption(Document document)
{
    // Get the selected Elements in the Active Document
    UIDocument uidoc = new UIDocument(document);
    ICollection<ElementId> selectedIds = uidoc.Selection.GetElementIds();

    foreach (ElementId id in selectedIds)
    {
        Element element = document.GetElement(id);
        //Use the DesignOption property of Element
        if (element.DesignOption != null)
        {
            TaskDialog.Show("Revit",element.DesignOption.Name.ToString());
        }
    }
}
```

 Copy  VB.NET

```
Private Sub Getinfo_DesignOption(document As Document)
    ' Get the selected Elements in the Active Document
    Dim uidoc As New UIDocument(document)
    Dim selectedIds As ICollection(Of ElementId) = uidoc.Selection.GetElementIds()

    For Each id As ElementId In selectedIds
        Dim element As Element = document.GetElement(id)
        'Use the DesignOption property of Element
        If element.DesignOption IsNot Nothing Then
            TaskDialog.Show("Revit", element.DesignOption.Name.ToString())
        End If
    Next
End Sub
```

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### CreateRibbonPanel Method (String, String)

---

|  |
| --- |
| UIApplication Class   See Also |

Create a new RibbonPanel on the specified tab.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual RibbonPanel CreateRibbonPanel( 	string tabName, 	string panelName ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function CreateRibbonPanel ( _ 	tabName As String, _ 	panelName As String _ ) As RibbonPanel ``` |

| Visual C++ |
| --- |
| ``` public: virtual RibbonPanel^ CreateRibbonPanel( 	String^ tabName,  	String^ panelName ) ``` |

#### Parameters

tabName
:   Type:  System String
     The name of the tab, on which the new panel will be created.

panelName
:   Type:  System String
     The name of the panel to be created.

# Remarks

This method will create a custom panel appending to the specified tab. This method is not supported in Macros.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | tabName or panelName is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | tabName or panelName is Empty. |
| Autodesk.Revit.Exceptions InvalidOperationException | Too many panels have been added to this tab (Maximum is 100). |

# See Also

UIApplication Class

CreateRibbonPanel Overload

Autodesk.Revit.UI Namespace

#### VersionGUID Property

---

|  |
| --- |
| DocumentVersion Class   See Also |

The GUID portion of the DocumentVersion. The GUID is updated when changes are made to the document, but may not update with every change to the document. The GUID and save number are both necessary to uniquely identify a document version.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public Guid VersionGUID { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property VersionGUID As Guid 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Guid VersionGUID { 	Guid get (); } ``` |

# See Also

DocumentVersion Class

Autodesk.Revit.DB Namespace

#### SetJournalData Method

---

|  |
| --- |
| ExecutedEventArgs Class   See Also |

Sets the journal data associated to this command (on journal playback).

**Namespace:**   Autodesk.Revit.UI.Events
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void SetJournalData( 	IDictionary<string, string> data ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetJournalData ( _ 	data As IDictionary(Of String, String) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetJournalData( 	IDictionary<String^, String^>^ data ) ``` |

#### Parameters

data
:   Type:  System.Collections.Generic IDictionary   String  ,  String

# Remarks

For details about the use of journal data associated to a command, see ExternalCommandData.JournalData.

# See Also

ExecutedEventArgs Class

Autodesk.Revit.UI.Events Namespace

#### RailingNotConnectedError Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

The Railing line must be a single connected Sketch. If you want separate pieces of Railing, create two or more separate Railings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId RailingNotConnectedError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RailingNotConnectedError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ RailingNotConnectedError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### CreateFailureDefinition Method

---

|  |
| --- |
| FailureDefinition Class   Example   See Also |

Creates an instance of a FailureDefinition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static FailureDefinition CreateFailureDefinition( 	FailureDefinitionId id, 	FailureSeverity severity, 	string messageString ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateFailureDefinition ( _ 	id As FailureDefinitionId, _ 	severity As FailureSeverity, _ 	messageString As String _ ) As FailureDefinition ``` |

| Visual C++ |
| --- |
| ``` public: static FailureDefinition^ CreateFailureDefinition( 	FailureDefinitionId^ id,  	FailureSeverity severity,  	String^ messageString ) ``` |

#### Parameters

id
:   Type:  Autodesk.Revit.DB FailureDefinitionId
     Unique identifier of the failure.

severity
:   Type:  Autodesk.Revit.DB FailureSeverity
     The severity of the failure. Cannot be FailureSeverity::None.

messageString
:   Type:  System String
     A user-visible string describing the failure.

#### Return Value

The created FailureDefinition instance.

# Remarks

The newly created FailureDefinition will be added to the FailureDefinitionRegistry. Because FailureDefinition could only be registered when Revit starting up, this function cannot be used after Revit has already started. Throws InvalidOperationException if invoked after Revit start-up is completed.

# Examples

 Copy  C#

```
// define a new failure id for a warning about walls
FailureDefinitionId warnId =
    new FailureDefinitionId(new Guid("FB4F5AF3-42BB-4371-B559-FB1648D5B4D1"));

// register the new warning using FailureDefinition
FailureDefinition failDef = FailureDefinition.CreateFailureDefinition(warnId,
    FailureSeverity.Warning,
    "Wall is too big (>100'). Performance problems may result.");
```

 Copy  VB.NET

```
' define a new failure id for a warning about walls
Dim warnId As New FailureDefinitionId(New Guid("FB4F5AF3-42BB-4371-B559-FB1648D5B4D1"))

' register the new warning using FailureDefinition
Dim failDef As FailureDefinition = FailureDefinition.CreateFailureDefinition(warnId, FailureSeverity.Warning, "Wall is too big (>100'). Performance problems may result.")
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The id of failure definition is not valid. -or- The id of failure definition is already used to register another FailureDefinition. -or- The severity of failures cannot be FailureSeverity::None. -or- Message string is empty or contains invalid characters. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

FailureDefinition Class

Autodesk.Revit.DB Namespace

#### GetObjectData Method

---

|  |
| --- |
| InvalidOperationException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

InvalidOperationException Class

Autodesk.Revit.Exceptions Namespace

#### SetShape Method

---

|  |
| --- |
| DirectShapeType Class   See Also |

Builds the type shape from the supplied collection of GeometryObjects. The objects are copied. If the new shape is identical to the old one, the old shape will be kept.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public void SetShape( 	IList<GeometryObject> pGeomArr ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetShape ( _ 	pGeomArr As IList(Of GeometryObject) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetShape( 	IList<GeometryObject^>^ pGeomArr ) ``` |

#### Parameters

pGeomArr
:   Type:  System.Collections.Generic IList   GeometryObject
     Shape of this object expressed as a collection of GeometryObjects. These will be copied. Shape and Category should be consistent: geometry supplied as shape should be valid for the Category the type object is associated with. The supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point, Curve and PolyLine.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | At least one member of pGeomArr does not satisfy DirectShapeType validation criteria. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectShapeType Class

SetShape Overload

Autodesk.Revit.DB Namespace

#### OwnerInfo Property

---

|  |
| --- |
| TessellatedShapeBuilder Class   See Also |

String used for logging, if any. Usually describes the element or object, which either defined or will own the geoemtrical objects to be built.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public string OwnerInfo { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property OwnerInfo As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ OwnerInfo { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

TessellatedShapeBuilder Class

Autodesk.Revit.DB Namespace

#### IsValidSectionType Method

---

|  |
| --- |
| TableView Class   See Also |

Identifies if the section type is valid for this view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidSectionType( 	SectionType sectionType ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidSectionType ( _ 	sectionType As SectionType _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidSectionType( 	SectionType sectionType ) ``` |

#### Parameters

sectionType
:   Type:  Autodesk.Revit.DB SectionType
     The section type.

#### Return Value

True if the Section Type is valid, false otherwise.

# Remarks

Some TableViews do not contain all of the possible section types. For example, standard schedules have only a Heading and Body.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

TableView Class

Autodesk.Revit.DB Namespace

#### RbsCurveDiameterParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Diameter"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsCurveDiameterParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsCurveDiameterParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsCurveDiameterParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### CombineElements Method

---

|  |
| --- |
| Document Class   See Also |

Combine a set of combinable elements into a geometry combination.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public GeomCombination CombineElements( 	CombinableElementArray members ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CombineElements ( _ 	members As CombinableElementArray _ ) As GeomCombination ``` |

| Visual C++ |
| --- |
| ``` public: GeomCombination^ CombineElements( 	CombinableElementArray^ members ) ``` |

#### Parameters

members
:   Type:  Autodesk.Revit.DB CombinableElementArray
     A list of combinable elements to be combined.

#### Return Value

If successful, the newly created geometry combination is returned, otherwise an exception with error information will be thrown.

# Remarks

If one or more existing geometry combinations are included as input, the return value may be one of those pre-existing combinations. The rest of the pre-existing geometry combinations will be consumed into the new combination; those handles are no longer valid.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when members contains less than two elements. Thrown when members contains    a null reference (  Nothing  in Visual Basic)  elements. |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when creation of the combination failed. |

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### SquareInchesPerFoot Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Square inches per foot.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SquareInchesPerFoot { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SquareInchesPerFoot As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SquareInchesPerFoot { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### ZoneEquipmentData Class

---

|  |
| --- |
| Members   See Also |

Represents the data and parameters of analytical zone equipment.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public class ZoneEquipmentData : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class ZoneEquipmentData _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class ZoneEquipmentData : IDisposable ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Mechanical ZoneEquipmentData

# See Also

ZoneEquipmentData Members

Autodesk.Revit.DB.Mechanical Namespace

#### Add Method

---

|  |
| --- |
| ExportLinetypeTable Class   See Also |

Inserts a (key, info) pair into Export line type table.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public void Add( 	ExportLinetypeKey exportLinetypeKey, 	ExportLinetypeInfo exportLinetypeInfo ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub Add ( _ 	exportLinetypeKey As ExportLinetypeKey, _ 	exportLinetypeInfo As ExportLinetypeInfo _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void Add( 	ExportLinetypeKey^ exportLinetypeKey,  	ExportLinetypeInfo^ exportLinetypeInfo ) ``` |

#### Parameters

exportLinetypeKey
:   Type:  Autodesk.Revit.DB ExportLinetypeKey
     The export line type Key to be added.

exportLinetypeInfo
:   Type:  Autodesk.Revit.DB ExportLinetypeInfo
     The export line type info to be added.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The key already exists in the table. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExportLinetypeTable Class

Autodesk.Revit.DB Namespace

#### Volume Property

---

|  |
| --- |
| RebarInSystem Class   See Also |

The volume of an individual bar multiplied by Quantity.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double Volume { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Volume As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double Volume { 	double get (); } ``` |

# See Also

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace

#### PipeFlowConfigurationType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all connector flow configuration

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum PipeFlowConfigurationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PipeFlowConfigurationType ``` |

| Visual C++ |
| --- |
| ``` public enum class PipeFlowConfigurationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Calculated | Flow configuration is calculated |
| Preset | Flow configuration is Preset |
| System | Flow configuration depends on system |
| Demand | Flow configuration depends on demand |

# See Also

Autodesk.Revit.DB.Plumbing Namespace

#### Dispose Method

---

|  |
| --- |
| FilterableValueProvider Class   See Also |

Releases all resources used by the  FilterableValueProvider

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

FilterableValueProvider Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| WorksharingDisplayGraphicSettings Class   See Also |

Releases all resources used by the  WorksharingDisplayGraphicSettings

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

WorksharingDisplayGraphicSettings Class

Autodesk.Revit.DB Namespace

#### RbsElecPanelFeedThruLugsCurrentPhasec Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Feed Through Lugs Current Phase C"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecPanelFeedThruLugsCurrentPhasec { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecPanelFeedThruLugsCurrentPhasec As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecPanelFeedThruLugsCurrentPhasec { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AddAllSegments Method

---

|  |
| --- |
| CurtainGridLine Class   See Also |

All the segments on this grid line will be added.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void AddAllSegments() ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddAllSegments ``` |

| Visual C++ |
| --- |
| ``` public: void AddAllSegments() ``` |

# See Also

CurtainGridLine Class

Autodesk.Revit.DB Namespace

#### SetDirectContext3DHandleSettings Method

---

|  |
| --- |
| DirectContext3DHandleOverrides Class   See Also |

Assigns override settings associated with a DirectContext3D handle instance or type.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public void SetDirectContext3DHandleSettings( 	Document aDoc, 	ElementId elementId, 	DirectContext3DHandleSettings newSettings ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetDirectContext3DHandleSettings ( _ 	aDoc As Document, _ 	elementId As ElementId, _ 	newSettings As DirectContext3DHandleSettings _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetDirectContext3DHandleSettings( 	Document^ aDoc,  	ElementId^ elementId,  	DirectContext3DHandleSettings^ newSettings ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     Document where elementId resides.

elementId
:   Type:  Autodesk.Revit.DB ElementId
     Id of the element to be overridden.

newSettings
:   Type:  Autodesk.Revit.DB.DirectContext3D DirectContext3DHandleSettings
     The override settings to be assigned to the handle element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The ElementId elementId is not a valid DirectContext3D handle instance or type. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

DirectContext3DHandleOverrides Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### AlignmentStationLabel Class

---

|  |
| --- |
| Members   See Also |

Represents an object which provides access to a specialized Revit annotation element used for labeling  Alignment  stations.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public class AlignmentStationLabel ``` |

| Visual Basic |
| --- |
| ``` Public Class AlignmentStationLabel ``` |

| Visual C++ |
| --- |
| ``` public ref class AlignmentStationLabel ``` |

# Remarks

The element is a  SpotDimension  . The element's category is  OST\_AlignmentStationLabels  or, if in a set of labels,  OST\_AlignmentStationLabelSets  . The element's type is a  SpotDimensionType  with  DimensionStyleType  equal to  AlignmentStationLabel  . The element's  Origin  is a point on the tessellated representation of an alignment. To get the precise point on the alignment's curve, use  GetPointAtStation(Double)  with input obtained from  Station  .

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB.Infrastructure AlignmentStationLabel

# See Also

AlignmentStationLabel Members

Autodesk.Revit.DB.Infrastructure Namespace

#### IsValidObject Property

---

|  |
| --- |
| InitialIntensity Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.Lighting
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

InitialIntensity Class

Autodesk.Revit.DB.Lighting Namespace

#### SetDistanceToTargetCover Method

---

|  |
| --- |
| RebarConstraint Class   See Also |

Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover.'

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public void SetDistanceToTargetCover( 	double distanceToTargetCover ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetDistanceToTargetCover ( _ 	distanceToTargetCover As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetDistanceToTargetCover( 	double distanceToTargetCover ) ``` |

#### Parameters

distanceToTargetCover
:   Type:  System Double
     The distance is given as an offset value, the sign of which depends on Host Cover direction.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | The given value for distanceToTargetCover must be no more than 30000 feet in absolute value. |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToCover.' |

# See Also

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace

#### AddVertex Method

---

|  |
| --- |
| VertexStreamPositionNormalColored Class   See Also |

Inserts a  VertexStreamPositionNormalColored  into the stream and associated buffer.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public void AddVertex( 	VertexPositionNormalColored vertex ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub AddVertex ( _ 	vertex As VertexPositionNormalColored _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void AddVertex( 	VertexPositionNormalColored^ vertex ) ``` |

#### Parameters

vertex
:   Type:  Autodesk.Revit.DB.DirectContext3D VertexPositionNormalColored
     The vertex to be inserted.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space. |

# See Also

VertexStreamPositionNormalColored Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### Function Property

---

|  |
| --- |
| FunctionId Class   See Also |

The name of the function throwing an exception.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public string Function { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Function As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Function { 	String^ get (); } ``` |

# See Also

FunctionId Class

Autodesk.Revit.Exceptions Namespace

#### DefaultFamilyType Property

---

|  |
| --- |
| ComponentRepeater Class   See Also |

The default family type for the component repeater.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ElementId DefaultFamilyType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DefaultFamilyType As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ DefaultFamilyType { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Remarks

The default family type is the type of the instances in default slots. This includes slots that are added when the repeater grows. When setting this property, all slots with instances of the default type will change their components to an instance of the new default type. Empty slots will remain unchanged. Slots with non-default family instances will remain unchanged.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: Invalid type for the repeater. The type must be an adaptive family with no shape handles. In addition, it must have same category and same number of placement points as the current type of the repeater. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ComponentRepeater Class

Autodesk.Revit.DB Namespace

#### MergeElbows Property

---

|  |
| --- |
| IndependentTag Class   See Also |

Identifies if the leaders' elbows are merged or not. If they are are merged, all elbows are in the same point and they move together.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public bool MergeElbows { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property MergeElbows As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool MergeElbows { 	bool get (); 	void set (bool value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: For this tag leaders are not allowed. -or- When setting this property: Can't merge elbows for tags that are part of a multi-reference annotation. |

# See Also

IndependentTag Class

Autodesk.Revit.DB Namespace

#### Rename Method

---

|  |
| --- |
| ViewSheetSetting Class   See Also |

Rename the current view sheet set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool Rename( 	string newName ) ``` |

| Visual Basic |
| --- |
| ``` Public Function Rename ( _ 	newName As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool Rename( 	String^ newName ) ``` |

#### Parameters

newName
:   Type:  System String
     View sheet set name to be renamed as.

#### Return Value

False if Rename operation fails, otherwise True.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when the input name is already existed in current view sheet set list. |

# See Also

ViewSheetSetting Class

Autodesk.Revit.DB Namespace

#### StructuralSectionTopCutWidth Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Top Cut Width"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralSectionTopCutWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralSectionTopCutWidth As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralSectionTopCutWidth { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ViewId Property

---

|  |
| --- |
| PreviewControl Class   See Also |

The view Id.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId ViewId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ViewId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ViewId { 	ElementId^ get (); } ``` |

# See Also

PreviewControl Class

Autodesk.Revit.UI Namespace

#### IsValidObject Property

---

|  |
| --- |
| PointCollection Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

PointCollection Class

Autodesk.Revit.DB.PointClouds Namespace

#### ModelTextType Property

---

|  |
| --- |
| ModelText Class   See Also |

The type for the model text.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ModelTextType ModelTextType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ModelTextType As ModelTextType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ModelTextType^ ModelTextType { 	ModelTextType^ get (); 	void set (ModelTextType^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when    a null reference (  Nothing  in Visual Basic)  is assigned to this property. |

# See Also

ModelText Class

Autodesk.Revit.DB Namespace

#### FabricationPartJustification Enumeration

---

|  |
| --- |
| See Also |

Fabrication part eccentric justifications for alignment for flat edged parts.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public enum FabricationPartJustification ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration FabricationPartJustification ``` |

| Visual C++ |
| --- |
| ``` public enum class FabricationPartJustification ``` |

# Members

| Member name | Description |
| --- | --- |
| Middle | Default middle justification to the connector |
| Bottom | Outside edge justification to the bottom |
| Top | Outside edge justification to the top |

# See Also

Autodesk.Revit.DB.Fabrication Namespace

#### TriangulatedSolidOrShell Class

---

|  |
| --- |
| Members   See Also |

This class represents a triangulated solid or shell.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public class TriangulatedSolidOrShell : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class TriangulatedSolidOrShell _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class TriangulatedSolidOrShell : IDisposable ``` |

# Remarks

The triangulation consists of a number of TriangulatedShellComponents. For a solid, there will be one TriangulatedShellComponent for each component of the solid's boundary. For example, a solid cube has just one boundary component (containing six faces), so there will be just one TriangulatedShellComponent. A solid consisting of two disjoint cubes has two boundary components (the boundaries of the two cubes), so there will be two TriangulatedShellComponents. A solid consisting of a sphere with a round void (or hole) inside it also has two boundary components (the outer sphere and the inner sphere), so there will be two TriangulatedShellComponents.

For a shell, there will be one TriangulatedShellComponent for each component of the shell.

Note that this class does not contain information on the containment structure of the boundary components of a solid.

Be careful not to confuse the components of a solid with the solid's boundary components. This class deals only with the boundary components.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB TriangulatedSolidOrShell

# See Also

TriangulatedSolidOrShell Members

Autodesk.Revit.DB Namespace

#### DistanceToCutMark Property

---

|  |
| --- |
| StairsPathType Class   See Also |

The distance from the stairs path arrow to cut mark.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double DistanceToCutMark { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property DistanceToCutMark As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double DistanceToCutMark { 	double get (); 	void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: The given value for distanceToCutMark must be between 0 and 30000 feet. |

# See Also

StairsPathType Class

Autodesk.Revit.DB.Architecture Namespace

#### Create Method

---

|  |
| --- |
| SelectionFilterElement Class   See Also |

Creates a new SelectionFilterElement in the given document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static SelectionFilterElement Create( 	Document document, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	name As String _ ) As SelectionFilterElement ``` |

| Visual C++ |
| --- |
| ``` public: static SelectionFilterElement^ Create( 	Document^ document,  	String^ name ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which to create the SelectionFilterElement.

name
:   Type:  System String
     The name for the new SelectionFilterElement.

#### Return Value

The new SelectionFilterElement.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a filter element name. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SelectionFilterElement Class

Autodesk.Revit.DB Namespace

#### PoundsMass Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Pounds mass.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PoundsMass { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PoundsMass As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PoundsMass { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### GetMappedHandle Method

---

|  |
| --- |
| VertexBuffer Class   See Also |

Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public IntPtr GetMappedHandle() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetMappedHandle As IntPtr ``` |

| Visual C++ |
| --- |
| ``` public: IntPtr GetMappedHandle() ``` |

#### Return Value

The handle to the mapped memory or nullptr when the buffer is not mapped.

# See Also

VertexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### StructuralBeamCutbackForColumn Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Beam cutback in plan"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralBeamCutbackForColumn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralBeamCutbackForColumn As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralBeamCutbackForColumn { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### StartStation Property

---

|  |
| --- |
| AlignmentStationLabelSetOptions Class   See Also |

The starting station for creating labels in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, the station value corresponding to the alignment's  DisplayedStartStation  is used.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public Nullable<double> StartStation { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property StartStation As Nullable(Of Double) 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Nullable<double> StartStation { 	Nullable<double> get (); 	void set (Nullable<double> value); } ``` |

# See Also

AlignmentStationLabelSetOptions Class

Autodesk.Revit.DB.Infrastructure Namespace

#### TextDistToLine Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Text Offset"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId TextDistToLine { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextDistToLine As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ TextDistToLine { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ExternalDataInstanceRemovingFromDocumentEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used by the ExternalDataInstanceRemovingFrom event.

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public class ExternalDataInstanceRemovingFromDocumentEventArgs : RevitAPIPreDocEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class ExternalDataInstanceRemovingFromDocumentEventArgs _ 	Inherits RevitAPIPreDocEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class ExternalDataInstanceRemovingFromDocumentEventArgs : public RevitAPIPreDocEventArgs ``` |

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreEventArgs
  Autodesk.Revit.DB.Events RevitAPIPreDocEventArgs
  Autodesk.Revit.DB.Events ExternalDataInstanceRemovingFromDocumentEventArgs

# See Also

ExternalDataInstanceRemovingFromDocumentEventArgs Members

Autodesk.Revit.DB.Events Namespace

#### InaccurateGrid Property

---

|  |
| --- |
| BuiltInFailures InaccurateFailures Class   See Also |

Grid is slightly off axis and may cause inaccuracies.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InaccurateGrid { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InaccurateGrid As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InaccurateGrid { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures InaccurateFailures Class

Autodesk.Revit.DB Namespace

#### DocumentSaveToCentralProgressChangedEventArgs Class

---

|  |
| --- |
| Members   See Also |

The event arguments used during the save to central phase of  [!:Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged]  .

**Namespace:**   Autodesk.Revit.DB.Events
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017 Subscription Update

# Syntax

| C# |
| --- |
| ``` public class DocumentSaveToCentralProgressChangedEventArgs : DataTransferProgressChangedEventArgs ``` |

| Visual Basic |
| --- |
| ``` Public Class DocumentSaveToCentralProgressChangedEventArgs _ 	Inherits DataTransferProgressChangedEventArgs ``` |

| Visual C++ |
| --- |
| ``` public ref class DocumentSaveToCentralProgressChangedEventArgs : public DataTransferProgressChangedEventArgs ``` |

# Remarks

It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time. Name correction - it is renamed from 'DocumentSaveToCentralProgessChangedEventArgs' released since 2017 Subscription Update.

# Inheritance Hierarchy

System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPISingleEventArgs
  Autodesk.Revit.DB.Events WorksharedOperationProgressChangedEventArgs
  Autodesk.Revit.DB.Events DataTransferProgressChangedEventArgs
  Autodesk.Revit.DB.Events DocumentSaveToCentralProgressChangedEventArgs

# See Also

DocumentSaveToCentralProgressChangedEventArgs Members

Autodesk.Revit.DB.Events Namespace

#### ProcessIFCProject Method (IFCAnyHandle)

---

|  |
| --- |
| ImporterIFC Class   See Also |

The entry point to the native IFC import function. Processes the main IfcProject and creates appropriate Revit elements.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void ProcessIFCProject( 	IFCAnyHandle ifcProject ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub ProcessIFCProject ( _ 	ifcProject As IFCAnyHandle _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void ProcessIFCProject( 	IFCAnyHandle^ ifcProject ) ``` |

#### Parameters

ifcProject
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
     The IfcProject containing the entities in the IFC file.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ImporterIFC Class

ProcessIFCProject Overload

Autodesk.Revit.DB.IFC Namespace

#### NumberOfFrames Property

---

|  |
| --- |
| SunAndShadowSettings Class   See Also |

Identifies the total number of animation frames for a single-day or multi-day study.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public double NumberOfFrames { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property NumberOfFrames As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double NumberOfFrames { 	double get (); } ``` |

# See Also

SunAndShadowSettings Class

Autodesk.Revit.DB Namespace

#### Create Method (Document, String, ICollection(ElementId), ElementFilter)

---

|  |
| --- |
| ParameterFilterElement Class   See Also |

Creates a new ParameterFilterElement in the given document.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2019

# Syntax

| C# |
| --- |
| ``` public static ParameterFilterElement Create( 	Document aDocument, 	string name, 	ICollection<ElementId> categories, 	ElementFilter elementFilter ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	aDocument As Document, _ 	name As String, _ 	categories As ICollection(Of ElementId), _ 	elementFilter As ElementFilter _ ) As ParameterFilterElement ``` |

| Visual C++ |
| --- |
| ``` public: static ParameterFilterElement^ Create( 	Document^ aDocument,  	String^ name,  	ICollection<ElementId^>^ categories,  	ElementFilter^ elementFilter ) ``` |

#### Parameters

aDocument
:   Type:  Autodesk.Revit.DB Document
     The document in which to create the ParameterFilterElement.

name
:   Type:  System String
     The user-visible name for the new ParameterFilterElement.

categories
:   Type:  System.Collections.Generic ICollection   ElementId
     The categories for the new ParameterFilterElement.

elementFilter
:   Type:  Autodesk.Revit.DB ElementFilter
     The rules for the new ParameterFilterElement, represented as an ElementFilter. ElementFilter is either an ElementParameterFilter or an ElementLogicalFilter representing a Boolean combination of ElementParameterFilters. In addition, we check that each ElementParameterFilter satisfies the following conditions: Its array of FilterRules is not empty and contains:

    * Any number of FilterRules of type FilterValueRule, FilterInverseRule, and SharedParameterApplicableRule or
    * Exactly one FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement or
    * Exactly two rules: the first one is a FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement and the second one is a FilterRule of type FilterValueRule, FilterInverseRule, or SharedParameterApplicableRule.

    Note that cases in the second and third bullet are currently allowed only if the parent node of ElementParameterFilter is LogicalOrFilter.

#### Return Value

A pointer to the new ParameterFilterElement.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a filter element name. -or- One of the given rules refers to a parameter that does not apply to this filter's categories. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | The ElementFilter is not acceptable for use by a ParameterFilterElement. |

# See Also

ParameterFilterElement Class

Create Overload

Autodesk.Revit.DB Namespace

#### Show Method (String, String)

---

|  |
| --- |
| TaskDialog Class   See Also |

Shows a task dialog with title, main instruction and a Close button.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static TaskDialogResult Show( 	string title, 	string mainInstruction ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Show ( _ 	title As String, _ 	mainInstruction As String _ ) As TaskDialogResult ``` |

| Visual C++ |
| --- |
| ``` public: static TaskDialogResult Show( 	String^ title,  	String^ mainInstruction ) ``` |

#### Parameters

title
:   Type:  System String
     The title of the task dialog.

mainInstruction
:   Type:  System String
     The main instruction of the task dialog.

#### Return Value

The user's response to the task dialog.

# See Also

TaskDialog Class

Show Overload

Autodesk.Revit.UI Namespace

#### BoundaryParamPresetLinear Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"State"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BoundaryParamPresetLinear { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BoundaryParamPresetLinear As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BoundaryParamPresetLinear { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetObjectData Method

---

|  |
| --- |
| OptionalFunctionalityNotAvailableException Class   See Also |

Retrieves data needed to serialize the target object.

**Namespace:**   Autodesk.Revit.Exceptions
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public override void GetObjectData( 	SerializationInfo info, 	StreamingContext context ) ``` |

| Visual Basic |
| --- |
| ``` Public Overrides Sub GetObjectData ( _ 	info As SerializationInfo, _ 	context As StreamingContext _ ) ``` |

| Visual C++ |
| --- |
| ``` public: virtual void GetObjectData( 	SerializationInfo^ info,  	StreamingContext context ) override ``` |

#### Parameters

info
:   Type:  System.Runtime.Serialization SerializationInfo
     Data needed to serialize or deserialize the object.

context
:   Type:  System.Runtime.Serialization StreamingContext
     The destination of the serialized stream.

#### Implements

 ISerializable GetObjectData(SerializationInfo, StreamingContext)
  \_Exception GetObjectData(SerializationInfo, StreamingContext)

# See Also

OptionalFunctionalityNotAvailableException Class

Autodesk.Revit.Exceptions Namespace

#### GetConstraintType Method

---

|  |
| --- |
| RebarConstraint Class   See Also |

Returns the RebarConstraintType of a RebarConstraint.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public RebarConstraintType GetConstraintType() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetConstraintType As RebarConstraintType ``` |

| Visual C++ |
| --- |
| ``` public: RebarConstraintType GetConstraintType() ``` |

#### Return Value

The RebarConstraintType of the specified RebarConstraint.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | RebarConstraint is no longer valid. |

# See Also

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace

#### ThermalMaterialParamLiquidViscosity Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Liquid Viscosity"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId ThermalMaterialParamLiquidViscosity { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ThermalMaterialParamLiquidViscosity As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ ThermalMaterialParamLiquidViscosity { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ArrayElementsWithoutAssociation Method

---

|  |
| --- |
| LinearArray Class   See Also |

Creates a new linear array from a set of elements.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ICollection<ElementId> ArrayElementsWithoutAssociation( 	Document aDoc, 	View dBView, 	ICollection<ElementId> ids, 	int count, 	XYZ translationToAnchorMember, 	ArrayAnchorMember anchorMember ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ArrayElementsWithoutAssociation ( _ 	aDoc As Document, _ 	dBView As View, _ 	ids As ICollection(Of ElementId), _ 	count As Integer, _ 	translationToAnchorMember As XYZ, _ 	anchorMember As ArrayAnchorMember _ ) As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ICollection<ElementId^>^ ArrayElementsWithoutAssociation( 	Document^ aDoc,  	View^ dBView,  	ICollection<ElementId^>^ ids,  	int count,  	XYZ^ translationToAnchorMember,  	ArrayAnchorMember anchorMember ) ``` |

#### Parameters

aDoc
:   Type:  Autodesk.Revit.DB Document
     The document.

dBView
:   Type:  Autodesk.Revit.DB View
     The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements. If elements include view-specific elements, they must belong to this view.

ids
:   Type:  System.Collections.Generic ICollection   ElementId
     The elements to array.

count
:   Type:  System Int32
     The number of array members to create including the initial element grouping. Must between 2 and 200.

translationToAnchorMember
:   Type:  Autodesk.Revit.DB XYZ
     The translation vector for the array.

anchorMember
:   Type:  Autodesk.Revit.DB ArrayAnchorMember
     Indicates if the translation vector specifies the location of the second member of the array, or the last member of the array.

#### Return Value

The ids of the elements created during the operation.

# Remarks

The resulting elements will not be associated with an array element.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given element id set is empty. -or- One or more elements in ids do not exist in the document. -or- One or more elements in ids is owned by different views and thus cannot be arrayed together. -or- One or more elements in ids is not arrayable. -or- count must be between 2 and 200. -or- The view is invalid for specific view elements array. -or- The translation point vector is invalid to array the element. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | Failed to create the linear array. |

# See Also

LinearArray Class

Autodesk.Revit.DB Namespace

#### CreateString Method

---

|  |
| --- |
| IFCData Class   See Also |

Creates a string data object.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static IFCData CreateString( 	string value ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CreateString ( _ 	value As String _ ) As IFCData ``` |

| Visual C++ |
| --- |
| ``` public: static IFCData^ CreateString( 	String^ value ) ``` |

#### Parameters

value
:   Type:  System String
     The string value.

#### Return Value

The IFCData object.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IFCData Class

Autodesk.Revit.DB.IFC Namespace

#### SystemClassification Property

---

|  |
| --- |
| ConnectorElement Class   See Also |

The system classification of the connector.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public MEPSystemClassification SystemClassification { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SystemClassification As MEPSystemClassification 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property MEPSystemClassification SystemClassification { 	MEPSystemClassification get (); 	void set (MEPSystemClassification value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions ArgumentsInconsistentException | When setting this property: The MEPSystemType is not valid for the domain of this connector. |

# See Also

ConnectorElement Class

Autodesk.Revit.DB Namespace

#### HasAssociatedParts Method (Document, LinkElementId)

---

|  |
| --- |
| PartUtils Class   See Also |

Checks if an element has associated parts.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public static bool HasAssociatedParts( 	Document hostDocument, 	LinkElementId hostOrLinkElementId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function HasAssociatedParts ( _ 	hostDocument As Document, _ 	hostOrLinkElementId As LinkElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool HasAssociatedParts( 	Document^ hostDocument,  	LinkElementId^ hostOrLinkElementId ) ``` |

#### Parameters

hostDocument
:   Type:  Autodesk.Revit.DB Document
     The document.

hostOrLinkElementId
:   Type:  Autodesk.Revit.DB LinkElementId
     The element to be checked for associated Parts.

#### Return Value

True if the element has associated Parts.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartUtils Class

HasAssociatedParts Overload

Autodesk.Revit.DB Namespace

#### GetElementIdOverrideValue Method

---

|  |
| --- |
| RebarContainerParameterManager Class   See Also |

Get the ElementId value for an overriden parameter.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public ElementId GetElementIdOverrideValue( 	ElementId paramId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetElementIdOverrideValue ( _ 	paramId As ElementId _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetElementIdOverrideValue( 	ElementId^ paramId ) ``` |

#### Parameters

paramId
:   Type:  Autodesk.Revit.DB ElementId
     The id of the parameter

#### Return Value

The override value of the parameter.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | paramId is not the id of a parameter in the current document, or its value type is not ElementId. -or- paramId is not a Rebar Container parameter -or- paramId has no override |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarContainerParameterManager Class

Autodesk.Revit.DB.Structure Namespace

#### Parameter Property

---

|  |
| --- |
| IntersectionResult Class   See Also |

1d parameter of the point of intersection.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double Parameter { get; internal set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property Parameter As Double 	Get 	Friend Set ``` |

| Visual C++ |
| --- |
| ``` public: property double Parameter { 	double get (); 	internal: void set (double value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

# See Also

IntersectionResult Class

Autodesk.Revit.DB Namespace

#### CannotCopySunAndShadowSettings Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

SunAndShadowSettings cannot be copied.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopySunAndShadowSettings { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopySunAndShadowSettings As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopySunAndShadowSettings { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### Lx Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol lx, indicating unit Lux.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Lx { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Lx As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Lx { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### UnifiedbitmapBitmap Property

---

|  |
| --- |
| UnifiedBitmap Class   See Also |

The property labeled "Source" from the "UnifiedBitmap" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public static string UnifiedbitmapBitmap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property UnifiedbitmapBitmap As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ UnifiedbitmapBitmap { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyString" and will contain a relative path.

# See Also

UnifiedBitmap Class

Autodesk.Revit.DB.Visual Namespace

#### SchemaName Property

---

|  |
| --- |
| IFCFileModelOptions Class   See Also |

The name of the schema.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public string SchemaName { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SchemaName As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ SchemaName { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

IFCFileModelOptions Class

Autodesk.Revit.DB.IFC Namespace

#### SteelElemWeldContinuous Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Continuous"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SteelElemWeldContinuous { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SteelElemWeldContinuous As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SteelElemWeldContinuous { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DimStyleLeaderTickMark Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Leader Tick Mark"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DimStyleLeaderTickMark { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DimStyleLeaderTickMark As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DimStyleLeaderTickMark { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### DocumentSynchronizedWithCentral Event

---

|  |
| --- |
| ControlledApplication Class   See Also |

Subscribe to the DocumentSynchronizedWithCentral event to be notified immediately after Revit has finished synchronizing a document with central model.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<DocumentSynchronizedWithCentralEventArgs> DocumentSynchronizedWithCentral ``` |

| Visual Basic |
| --- |
| ``` Public Event DocumentSynchronizedWithCentral As EventHandler(Of DocumentSynchronizedWithCentralEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<DocumentSynchronizedWithCentralEventArgs^>^ DocumentSynchronizedWithCentral { 	void add (EventHandler<DocumentSynchronizedWithCentralEventArgs^>^ value); 	void remove (EventHandler<DocumentSynchronizedWithCentralEventArgs^>^ value); } ``` |

# Remarks

This event is raised immediately after Revit has finished synchronizing a document with central model. It is raised even when document synchronizing with central model failed or was cancelled (during DocumentSynchronizingWithCentral event).

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Check the 'Status' field in event's argument to see whether the action itself was successful or not.

This event is not cancellable, for the process of synchronizing a document with central model has already been finished.

If the action was not successful, the document may not be modified and new transactions may not be started.

The following API functions are not available for the current document during this event:

* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### FabricationPartDepthIn Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Main Primary Depth"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId FabricationPartDepthIn { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartDepthIn As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ FabricationPartDepthIn { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| CurveExtents Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

CurveExtents Class

Autodesk.Revit.DB Namespace

#### AnalyticalModelPhysicalType Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Family Type": the Family Type of the physical element associated with the Analytical Model

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId AnalyticalModelPhysicalType { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property AnalyticalModelPhysicalType As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ AnalyticalModelPhysicalType { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AreElementsValidForCreateParts Method

---

|  |
| --- |
| PartUtils Class   See Also |

Identifies if the given elements can be used to create parts.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool AreElementsValidForCreateParts( 	Document document, 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function AreElementsValidForCreateParts ( _ 	document As Document, _ 	elementIds As ICollection(Of ElementId) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool AreElementsValidForCreateParts( 	Document^ document,  	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document.

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     Element ids to be tested for validity for creating parts.

#### Return Value

True if all member ids are valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartUtils Class

Autodesk.Revit.DB Namespace

#### AddSpatialFieldPrimitive Method (Curve, Transform)

---

|  |
| --- |
| SpatialFieldManager Class   See Also |

Creates empty analysis results primitive associated with a curve and a transform.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public int AddSpatialFieldPrimitive( 	Curve curve, 	Transform trf ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AddSpatialFieldPrimitive ( _ 	curve As Curve, _ 	trf As Transform _ ) As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int AddSpatialFieldPrimitive( 	Curve^ curve,  	Transform^ trf ) ``` |

#### Parameters

curve
:   Type:  Autodesk.Revit.DB Curve
     Curve to be associated with the primitive. %curve% does NOT correspond to actual Revit geometry, i.e. it cannot be associated with reference; otherwise the other overload of the method must be used (taking "reference" as the input)

trf
:   Type:  Autodesk.Revit.DB Transform
     Conformal Transform to be applied to %curve%.

#### Return Value

Unique index of primitive for future references

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input curve points to a helical curve and is not supported for this operation. -or- Argument trf is not a conformal transform (see property Revit::DB::Transform::IsConformal) |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

SpatialFieldManager Class

AddSpatialFieldPrimitive Overload

Autodesk.Revit.DB.Analysis Namespace

#### UpdateAllOpenViews Method

---

|  |
| --- |
| UIDocument Class   See Also |

Update all open views in this document after elements have been changed, deleted, selected or de-selected. Graphics in the views are fully redrawn regardless of which elements have changed.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public void UpdateAllOpenViews() ``` |

| Visual Basic |
| --- |
| ``` Public Sub UpdateAllOpenViews ``` |

| Visual C++ |
| --- |
| ``` public: void UpdateAllOpenViews() ``` |

# Remarks

This function should only rarely be needed, but might be required when working with graphics drawn from outside of Revit's transactions and elements, for example, when using  IDirectContext3DServer  . This function is potentially expensive as many views may be updated at once, including regeneration of view's geometry and redisplay of graphics. Thus for most situations it is recommended that API applications rely on the Revit application framework to update views more deliberately.

# See Also

UIDocument Class

Autodesk.Revit.UI Namespace

#### SpoolName Property

---

|  |
| --- |
| FabricationPart Class   See Also |

The spool name of the fabrication part.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public string SpoolName { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SpoolName As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ SpoolName { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | When setting this property: |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace

#### SurfaceTriangulationFailed Property

---

|  |
| --- |
| BuiltInFailures SiteFailures Class   See Also |

The Site Surface failed to triangulate.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SurfaceTriangulationFailed { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SurfaceTriangulationFailed As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SurfaceTriangulationFailed { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SiteFailures Class

Autodesk.Revit.DB Namespace

#### GetParts Method

---

|  |
| --- |
| ConnectionValidationWarning Class   See Also |

Get ElementIds of affected parts.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public ISet<ElementId> GetParts() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetParts As ISet(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ISet<ElementId^>^ GetParts() ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

ConnectionValidationWarning Class

Autodesk.Revit.DB Namespace

#### FileImporting Event

---

|  |
| --- |
| ControlledApplication Class   See Also |

Subscribe to the FileImporting event to be notified when Revit is just about to import a file of format supported by the API.

**Namespace:**   Autodesk.Revit.ApplicationServices
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2010

# Syntax

| C# |
| --- |
| ``` public event EventHandler<FileImportingEventArgs> FileImporting ``` |

| Visual Basic |
| --- |
| ``` Public Event FileImporting As EventHandler(Of FileImportingEventArgs) ``` |

| Visual C++ |
| --- |
| ``` public:  event EventHandler<FileImportingEventArgs^>^ FileImporting { 	void add (EventHandler<FileImportingEventArgs^>^ value); 	void remove (EventHandler<FileImportingEventArgs^>^ value); } ``` |

# Remarks

This event is raised when Revit is just about to import a file of format supported by the API.

Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.

Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True. Your application is responsible for providing feedback to the user about the reason for the cancellation.

The following API functions are not available for the current document during this event:

* All overloads of Autodesk.Revit.DB.Document.Import()
* Close  and similar overloads.
* Save  .
* SaveAs(String)  and similar overloads.

Exception  InvalidOperationException  will be thrown if any of the above methods is called during this event.

Another  FileImported  event will be raised immediately after file importing is finished.

# See Also

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace

#### MepEquipmentCalcPipingpressuredropParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Calculated Pressure Drop"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MepEquipmentCalcPipingpressuredropParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MepEquipmentCalcPipingpressuredropParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MepEquipmentCalcPipingpressuredropParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InsulationTypes Property

---

|  |
| --- |
| TemperatureRatingType Class   See Also |

Get all insulation types defined in this temperature rating type and its corresponding material type.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public InsulationTypeSet InsulationTypes { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property InsulationTypes As InsulationTypeSet 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property InsulationTypeSet^ InsulationTypes { 	InsulationTypeSet^ get (); } ``` |

# See Also

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace

#### PreviewViewId Property

---

|  |
| --- |
| DocumentPreviewSettings Class   See Also |

The view id that will be used to generate the preview.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public ElementId PreviewViewId { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PreviewViewId As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ PreviewViewId { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

#### Field Value

InvalidElementId signals that there is no permanent preview view for the document. Where possible the document's active view will be used to generate the preview upon save; where there is no active view the document will not include a preview.

# Remarks

This view will always be saved as the preview view for the document unless it is overridden by the value used in SaveOptions or SaveAsOptions.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | When setting this property: The view id is not valid to use as a preview view. |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

DocumentPreviewSettings Class

Autodesk.Revit.DB Namespace

#### ChillerType Property

---

|  |
| --- |
| WaterLoopData Class   See Also |

The type of water chiller. Note this property change would reset the condenser water loop.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public WaterChillerType ChillerType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ChillerType As WaterChillerType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property WaterChillerType ChillerType { 	WaterChillerType get (); 	void set (WaterChillerType value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

WaterLoopData Class

Autodesk.Revit.DB.Mechanical Namespace

#### GetAddInName Method

---

|  |
| --- |
| AddInId Class   See Also |

name of addin associated with this AddInId Attempts to obtain the name from loaded Third Party AddIns

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string GetAddInName() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetAddInName As String ``` |

| Visual C++ |
| --- |
| ``` public: String^ GetAddInName() ``` |

#### Return Value

name of addin

# See Also

AddInId Class

Autodesk.Revit.DB Namespace

#### GetLoops Method

---

|  |
| --- |
| IFCExtrusionData Class   See Also |

Gets the curve loops that form the base shape of the extrusion.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public IList<CurveLoop> GetLoops() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetLoops As IList(Of CurveLoop) ``` |

| Visual C++ |
| --- |
| ``` public: IList<CurveLoop^>^ GetLoops() ``` |

#### Return Value

The collection of loops.

# See Also

IFCExtrusionData Class

Autodesk.Revit.DB.IFC Namespace

#### GroupType Class

---

|  |
| --- |
| Members   Example   See Also |

An element representing a group of elements that may be placed many times in a project or family.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public class GroupType : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class GroupType _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class GroupType : public ElementType ``` |

# Remarks

Grouping elements is useful when you need to create entities that represent repeating layouts or are common to many building projects, such as hotel rooms, apartments, or repeating floors.

# Examples

 Copy  C#

```
public void GetInfo_GroupType(GroupType groupType)
{
    string message = "GroupType";
    //Retrieve a set of all the groups that have this type.
    foreach (Group group in groupType.Groups)
    {
        // Get GroupType group name
        message = "\nThe group type name is : " + groupType.Name;
        //Returns all the members of the group.
        message += "\nThe types and ids of the group members are : ";
        IList<ElementId> groupMembers = group.GetMemberIds();
        foreach (ElementId memberId in groupMembers)
        {
            Element element = group.Document.GetElement(memberId);
            // Get GroupType group element id
            message += "\n\t" + element.GetType().Name + " : " + memberId.ToString();
        }
    }
    TaskDialog.Show("Revit",message);
}
```

 Copy  VB.NET

```
Public Sub GetInfo_GroupType(groupType As GroupType)
    Dim message As String = "GroupType"
    'Retrieve a set of all the groups that have this type.
    For Each group As Group In groupType.Groups
        ' Get GroupType group name
        message = vbLf & "The group type name is : " & Convert.ToString(groupType.Name)
        'Returns all the members of the group.
        message += vbLf & "The types and ids of the group members are : "
        Dim groupMembers As IList(Of ElementId) = group.GetMemberIds()
        For Each memberId As ElementId In groupMembers
            Dim element As Element = group.Document.GetElement(memberId)
            ' Get GroupType group element id
            message += (vbLf & vbTab + element.GetType.Name & " : ") + memberId.IntegerValue
        Next
    Next
    TaskDialog.Show("Revit", message)
End Sub
```

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB GroupType

# See Also

GroupType Members

Autodesk.Revit.DB Namespace

#### PlanarMultiPlanarShape Property

---

|  |
| --- |
| BuiltInFailures RebarShapeFailures Class   See Also |

The current shape is only bent in a single plane. A multi-planar definition is not required. Please redefine the shape on the top plane only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId PlanarMultiPlanarShape { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PlanarMultiPlanarShape As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ PlanarMultiPlanarShape { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures RebarShapeFailures Class

Autodesk.Revit.DB Namespace

#### IsCellOverridden Method (Int32)

---

|  |
| --- |
| TableSectionData Class   See Also |

Indicates if the column is overridden or not.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsCellOverridden( 	int nCol ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsCellOverridden ( _ 	nCol As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsCellOverridden( 	int nCol ) ``` |

#### Parameters

nCol
:   Type:  System Int32

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given column number nCol is invalid. |

# See Also

TableSectionData Class

IsCellOverridden Overload

Autodesk.Revit.DB Namespace

#### Value Property

---

|  |
| --- |
| VendorIdAttribute Class   See Also |

AddInId VendorId value.

**Namespace:**   Autodesk.Revit.DB.Macros
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public string Value { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Value As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ Value { 	String^ get (); } ``` |

# See Also

VendorIdAttribute Class

Autodesk.Revit.DB.Macros Namespace

#### ColumnBaseAboveTopFailure Property

---

|  |
| --- |
| BuiltInFailures ColumnFailures Class   See Also |

The column base can't be moved above its top.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ColumnBaseAboveTopFailure { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ColumnBaseAboveTopFailure As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ColumnBaseAboveTopFailure { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ColumnFailures Class

Autodesk.Revit.DB Namespace

#### SheetCheckedBy Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Checked By"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId SheetCheckedBy { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SheetCheckedBy As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ SheetCheckedBy { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TextureScaleLock Property

---

|  |
| --- |
| BumpMap Class   See Also |

The property labeled "Scale Lock" from the "BumpMap" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string TextureScaleLock { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property TextureScaleLock As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ TextureScaleLock { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

BumpMap Class

Autodesk.Revit.DB.Visual Namespace

#### TextBox Class

---

|  |
| --- |
| Members   See Also |

The TextBox object represents text-based control that allows the user to enter text.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public class TextBox : RibbonItem ``` |

| Visual Basic |
| --- |
| ``` Public Class TextBox _ 	Inherits RibbonItem ``` |

| Visual C++ |
| --- |
| ``` public ref class TextBox : public RibbonItem ``` |

# Remarks

The ItemText property inherited from RibbonItem has no effect. The text entered in the TextBox is edited by the UI user is accepted only if the user presses the Enter key or click the image button when ShowImageAsButton is true. If the user clicks off of this component without pressing Enter or click the image button; then the text will be reverted to the previous value. Use of this class is not supported in Revit Macros.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.UI RibbonItem
  Autodesk.Revit.UI TextBox

# See Also

TextBox Members

Autodesk.Revit.UI Namespace

#### SculptingCurvesTouchAxis Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

The highlighted curves touch the axis.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SculptingCurvesTouchAxis { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SculptingCurvesTouchAxis As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SculptingCurvesTouchAxis { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### SketchFailurePlanes Property

---

|  |
| --- |
| BuiltInFailures SketchFailures Class   See Also |

Sketch is no longer parallel to its defining plane

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId SketchFailurePlanes { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SketchFailurePlanes As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ SketchFailurePlanes { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures SketchFailures Class

Autodesk.Revit.DB Namespace

#### FoldWidth Property

---

|  |
| --- |
| StructuralSectionSigmaProfileWithFold Class   See Also |

Fold segment width.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double FoldWidth { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property FoldWidth As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double FoldWidth { 	double get (); 	void set (double value); } ``` |

# See Also

StructuralSectionSigmaProfileWithFold Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### ElementArrayIterator Constructor

---

|  |
| --- |
| ElementArrayIterator Class   See Also |

For Internal Use Only.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ElementArrayIterator() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ElementArrayIterator() ``` |

# Remarks

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

# See Also

ElementArrayIterator Class

Autodesk.Revit.DB Namespace

#### DekanewtonsPerMeter Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Dekanewtons per meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId DekanewtonsPerMeter { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property DekanewtonsPerMeter As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ DekanewtonsPerMeter { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### Volume Property

---

|  |
| --- |
| SpecTypeId Class   See Also |

Volume, in discipline Common.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Volume { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Volume As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Volume { 	ForgeTypeId^ get (); } ``` |

# See Also

SpecTypeId Class

Autodesk.Revit.DB Namespace

#### PageOrientationType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all Page Orientation types of Print Setting

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public enum PageOrientationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PageOrientationType ``` |

| Visual C++ |
| --- |
| ``` public enum class PageOrientationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Portrait | The type of Page Orientation is Portrait |
| Landscape | The type of Page Orientation is Landscape |
| Auto | Auto Page Orientation |

# See Also

Autodesk.Revit.DB Namespace

#### CenterCurve Property

---

|  |
| --- |
| StructuralElementDefinitionData Class   See Also |

The curve lying in the geometrical center of the element.

**Namespace:**   Autodesk.Revit.DB.Structure.StructuralSections
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018

# Syntax

| C# |
| --- |
| ``` public Curve CenterCurve { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property CenterCurve As Curve 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Curve^ CenterCurve { 	Curve^ get (); } ``` |

# See Also

StructuralElementDefinitionData Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace

#### SchedulableField Constructor (ScheduleFieldType, ElementId)

---

|  |
| --- |
| SchedulableField Class   See Also |

Creates a new SchedulableField.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public SchedulableField( 	ScheduleFieldType fieldType, 	ElementId parameterId ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	fieldType As ScheduleFieldType, _ 	parameterId As ElementId _ ) ``` |

| Visual C++ |
| --- |
| ``` public: SchedulableField( 	ScheduleFieldType fieldType,  	ElementId^ parameterId ) ``` |

#### Parameters

fieldType
:   Type:  Autodesk.Revit.DB ScheduleFieldType
     The type of data displayed by the field.

parameterId
:   Type:  Autodesk.Revit.DB ElementId
     The ID of the parameter displayed by the field.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | fieldType is not a schedulable field type |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

SchedulableField Class

SchedulableField Overload

Autodesk.Revit.DB Namespace

#### PhyMaterialParamCompressionPerpendicular Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Compression perpendicular to grain"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PhyMaterialParamCompressionPerpendicular { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PhyMaterialParamCompressionPerpendicular As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PhyMaterialParamCompressionPerpendicular { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### PostFailure Method

---

|  |
| --- |
| FailuresAccessor Class   See Also |

Posts an additional failure message to be processed for the current transaction.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void PostFailure( 	FailureMessage failure ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub PostFailure ( _ 	failure As FailureMessage _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void PostFailure( 	FailureMessage^ failure ) ``` |

#### Parameters

failure
:   Type:  Autodesk.Revit.DB FailureMessage
     Failure message to post.

# Remarks

Should be used during failures processing instead of a similar method in a document class. Using method of the document class with the same name during failures processing is prohibited.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

# See Also

FailuresAccessor Class

Autodesk.Revit.DB Namespace

#### IsGridAspectRatioSet Method

---

|  |
| --- |
| OBJExportOptions Class   See Also |

Checks whether the GridAspectRatio tessellation parameter is explicitly set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public bool IsGridAspectRatioSet() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsGridAspectRatioSet As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsGridAspectRatioSet() ``` |

#### Return Value

True if GridAspectRatio tessellation parameter is explicitly set, false otherwise.

# See Also

OBJExportOptions Class

Autodesk.Revit.DB Namespace

#### ShowHiddenLinesValues Enumeration

---

|  |
| --- |
| See Also |

Provides options for display of hidden lines in a given view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ShowHiddenLinesValues ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ShowHiddenLinesValues ``` |

| Visual C++ |
| --- |
| ``` public enum class ShowHiddenLinesValues ``` |

# Members

| Member name | Description |
| --- | --- |
| None | Do not show any hidden lines. |
| ByDiscipline | Show hidden lines according to discipline. |
| All | Show all hidden lines. |

# See Also

Autodesk.Revit.DB Namespace

#### RightOffset Property

---

|  |
| --- |
| CameraInfo Class   See Also |

Distance that the target plane is offset towards the right where right is normal to both Up direction and View direction. This offset shifts both left and right planes.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public double RightOffset { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property RightOffset As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double RightOffset { 	double get (); } ``` |

# See Also

CameraInfo Class

Autodesk.Revit.DB Namespace

#### SolidGeometry Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing possible ways of exporting solids in 3D views.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum SolidGeometry ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SolidGeometry ``` |

| Visual C++ |
| --- |
| ``` public enum class SolidGeometry ``` |

# Members

| Member name | Description |
| --- | --- |
| Polymesh | All visible solids are exported as polymesh. |
| ACIS | All visible Revit Building geometry is exported as ACIS 3D solids (except for any elements that are already a polymesh.) |

# See Also

Autodesk.Revit.DB Namespace

#### LoadFamily Method (String, IFamilyLoadOptions, Family)

---

|  |
| --- |
| Document Class   See Also |

Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public bool LoadFamily( 	string filename, 	IFamilyLoadOptions familyLoadOptions, 	out Family family ) ``` |

| Visual Basic |
| --- |
| ``` Public Function LoadFamily ( _ 	filename As String, _ 	familyLoadOptions As IFamilyLoadOptions, _ 	<OutAttribute> ByRef family As Family _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool LoadFamily( 	String^ filename,  	IFamilyLoadOptions^ familyLoadOptions,  	[OutAttribute] Family^% family ) ``` |

#### Parameters

filename
:   Type:  System String
     The fully qualified filename of the Family file, usually ending in .rfa.

familyLoadOptions
:   Type:  Autodesk.Revit.DB IFamilyLoadOptions
     The interface implementation to use when loading a family into the document.

family
:   Type:  Autodesk.Revit.DB Family   %
     A reference to the family that was loaded if successful, otherwise Nothing.

#### Return Value

True if the entire family was loaded successfully into the project, otherwise False.

# Remarks

Loading an entire family may take a considerable amount of time and memory. It is recommended that you use one of the LoadFamilySymbol() methods and only load those symbols that you need.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Thrown when filename is    a null reference (  Nothing  in Visual Basic)  or empty. |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when the input argument "familyLoadOptions" is    a null reference (  Nothing  in Visual Basic)  . |

# See Also

Document Class

LoadFamily Overload

Autodesk.Revit.DB Namespace

#### RenderingQuality Property

---

|  |
| --- |
| RenderingQualitySettings Class   See Also |

The quality applied for rendering.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public RenderingQuality RenderingQuality { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property RenderingQuality As RenderingQuality 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property RenderingQuality RenderingQuality { 	RenderingQuality get (); 	void set (RenderingQuality value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

RenderingQualitySettings Class

Autodesk.Revit.DB Namespace

#### Dispose Method

---

|  |
| --- |
| ElementFilter Class   See Also |

Releases all resources used by the  ElementFilter

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

ElementFilter Class

Autodesk.Revit.DB Namespace

#### GetUnderlayTopLevel Method

---

|  |
| --- |
| ViewPlan Class   See Also |

Returns the element id of the level that defines the top of the underlay range.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public ElementId GetUnderlayTopLevel() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetUnderlayTopLevel As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetUnderlayTopLevel() ``` |

#### Return Value

If the underlay base level is a valid level, and this method returns InvalidElementId, then the underlay range is unbounded, and consists of everything above the underlay base level.

# See Also

ViewPlan Class

Autodesk.Revit.DB Namespace

#### PathReinSpacing Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bar Spacing"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId PathReinSpacing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property PathReinSpacing As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ PathReinSpacing { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ColumnZeroHeightError Property

---

|  |
| --- |
| BuiltInFailures ColumnFailures Class   See Also |

The column can't have zero height

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId ColumnZeroHeightError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property ColumnZeroHeightError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ ColumnZeroHeightError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ColumnFailures Class

Autodesk.Revit.DB Namespace

#### IsLinked Property

---

|  |
| --- |
| Document Class   See Also |

Identifies if a document is a linked RVT.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsLinked { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsLinked As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsLinked { 	bool get (); } ``` |

# See Also

Document Class

Autodesk.Revit.DB Namespace

#### MoveNext Method

---

|  |
| --- |
| CorrectionFactorSetIterator Class   See Also |

Move the iterator one item forward.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool MoveNext() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function MoveNext As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool MoveNext() ``` |

#### Return Value

Returns True if the iterator was successfully moved forward one item and the Current property will return a valid item. False will be returned it the iterator has reached the end of the set.

#### Implements

 IEnumerator MoveNext

# Remarks

MoveNext must be called before the Current property is valid with a new or Reset iterator in line with the expected behavior of IEnumerator.

# See Also

CorrectionFactorSetIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### CannotCopyBetweenFamilyAndProjectCorruption Property

---

|  |
| --- |
| BuiltInFailures CopyPasteFailures Class   See Also |

Can't copy between Family and Project.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CannotCopyBetweenFamilyAndProjectCorruption { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CannotCopyBetweenFamilyAndProjectCorruption As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CannotCopyBetweenFamilyAndProjectCorruption { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures CopyPasteFailures Class

Autodesk.Revit.DB Namespace

#### GetTemperature Method

---

|  |
| --- |
| CorrectionFactor Class   See Also |

Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public double GetTemperature() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetTemperature As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetTemperature() ``` |

# See Also

CorrectionFactor Class

Autodesk.Revit.DB.Electrical Namespace

#### IsDeterminedByFormula Property

---

|  |
| --- |
| FamilyParameter Class   See Also |

Indicates if the parameter is determined by formula.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsDeterminedByFormula { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsDeterminedByFormula As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsDeterminedByFormula { 	bool get (); } ``` |

# Remarks

The parameter is read only if it is determined by formula.

# See Also

FamilyParameter Class

Autodesk.Revit.DB Namespace

#### SolidglassColorByObject Property

---

|  |
| --- |
| SolidGlass Class   See Also |

The property labeled "Custom Color" from the "SolidGlass" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string SolidglassColorByObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property SolidglassColorByObject As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ SolidglassColorByObject { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

SolidGlass Class

Autodesk.Revit.DB.Visual Namespace

#### IsDataCompleted Method

---

|  |
| --- |
| ZoneEquipmentData Class   See Also |

Is the required data completed for this zone equipment?

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public bool IsDataCompleted() ``` |

| Visual Basic |
| --- |
| ``` Public Function IsDataCompleted As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsDataCompleted() ``` |

# See Also

ZoneEquipmentData Class

Autodesk.Revit.DB.Mechanical Namespace

#### NewRooms2 Method (Level)

---

|  |
| --- |
| Document Class   See Also |

Creates new rooms in each plan circuit found in the given level in the last phase.

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ICollection<ElementId> NewRooms2( 	Level level ) ``` |

| Visual Basic |
| --- |
| ``` Public Function NewRooms2 ( _ 	level As Level _ ) As ICollection(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: ICollection<ElementId^>^ NewRooms2( 	Level^ level ) ``` |

#### Parameters

level
:   Type:  Autodesk.Revit.DB Level
     The level from which the circuits are found.

#### Return Value

If successful, a set of ElementIds which contains the rooms created should be returned, otherwise    a null reference (  Nothing  in Visual Basic)  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | If the view of the relevant level can not be retrieved. |
| Autodesk.Revit.Exceptions InvalidOperationException | If the phase is invalid, or regeneration fails at the end of the creation. |
| Autodesk.Revit.Exceptions ArgumentException | Thrown if the level does not exist in the given document. |

# See Also

Document Class

NewRooms2 Overload

Autodesk.Revit.Creation Namespace

#### WallSweepOrientation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Orientation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId WallSweepOrientation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property WallSweepOrientation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ WallSweepOrientation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### RotateElements Method

---

|  |
| --- |
| ElementTransformUtils Class   See Also |

Rotates a set of elements about the given axis and angle.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static void RotateElements( 	Document document, 	ICollection<ElementId> elementsToRotate, 	Line axis, 	double angle ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub RotateElements ( _ 	document As Document, _ 	elementsToRotate As ICollection(Of ElementId), _ 	axis As Line, _ 	angle As Double _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void RotateElements( 	Document^ document,  	ICollection<ElementId^>^ elementsToRotate,  	Line^ axis,  	double angle ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document that owns the elements.

elementsToRotate
:   Type:  System.Collections.Generic ICollection   ElementId
     The set of elements to rotate.

axis
:   Type:  Autodesk.Revit.DB Line
     The axis of rotation.

angle
:   Type:  System Double
     The angle of rotation in radians.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The given element id set is empty. -or- One or more elements in elementsToRotate do not exist in the document. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ElementTransformUtils Class

Autodesk.Revit.DB Namespace

#### RbsElecRoomAverageIllumination Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Average Estimated Illumination"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecRoomAverageIllumination { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecRoomAverageIllumination As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecRoomAverageIllumination { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### AreaFilter Constructor

---

|  |
| --- |
| AreaFilter Class   See Also |

Constructs a filter which matches only areas.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public AreaFilter() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: AreaFilter() ``` |

# See Also

AreaFilter Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| CurtainGridSet Class   See Also |

Removes every item from the set, rendering it empty.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Clear() ``` |

# See Also

CurtainGridSet Class

Autodesk.Revit.DB Namespace

#### CanInsertRow Method

---

|  |
| --- |
| TableSectionData Class   See Also |

Verifies if a new row can be inserted at the given index.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool CanInsertRow( 	int nIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Function CanInsertRow ( _ 	nIndex As Integer _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool CanInsertRow( 	int nIndex ) ``` |

#### Parameters

nIndex
:   Type:  System Int32

#### Return Value

True if the row can be inserted, false otherwise.

# See Also

TableSectionData Class

Autodesk.Revit.DB Namespace

#### SetAttribute Method (String, IFCAnyHandle)

---

|  |
| --- |
| IFCAnyHandle Class   See Also |

Sets the attribute value.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void SetAttribute( 	string name, 	IFCAnyHandle value ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetAttribute ( _ 	name As String, _ 	value As IFCAnyHandle _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetAttribute( 	String^ name,  	IFCAnyHandle^ value ) ``` |

#### Parameters

name
:   Type:  System String
     The attribute name.

value
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle
     The value.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

IFCAnyHandle Class

SetAttribute Overload

Autodesk.Revit.DB.IFC Namespace

#### HasEmbeddedSchedule Property

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Indicates if this ScheduleDefinition has an embedded ScheduleDefinition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool HasEmbeddedSchedule { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property HasEmbeddedSchedule As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool HasEmbeddedSchedule { 	bool get (); } ``` |

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### TransformWithBoundary Class

---

|  |
| --- |
| Members   See Also |

This class contains the transform from model space to projection space for a view and the boundary in model space in which the transform is valid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public class TransformWithBoundary : IDisposable ``` |

| Visual Basic |
| --- |
| ``` Public Class TransformWithBoundary _ 	Implements IDisposable ``` |

| Visual C++ |
| --- |
| ``` public ref class TransformWithBoundary : IDisposable ``` |

# Remarks

Use the model-to-projection transform returned by  GetModelToProjectionTransform  to transform model points to the view's projection space. The model-to-projection transform is only valid for points in 3D model space that that can be seen through the 2D boundary returned by  GetBoundary  , when looking in the direction of  [!:View.ViewDirection]  .

For views that are placed on sheets, you can combine the View's model-to-projection transform and the Viewport's projection-to-sheet transform to transform model points to sheet space:

sheetXYZ = projectionToSheetTransform \* modelToProjectionTransform \* modelXYZ

Model space is the global 3D coordinate space in which the 3D geometry of the model lives.

View projection space is the 3D Euclidean space with a coordinate system such that X and Y are horizontal and vertical directions in the view projection plane and Z is the cross product of X and Y. Distances in the projection space are the same as would be measured on paper if the view is printed without additional scaling.

Sheet space is the coordinate space of one sheet. This is the space in which viewports and titleblocks are arranged on the sheet.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB TransformWithBoundary

# See Also

TransformWithBoundary Members

Autodesk.Revit.DB Namespace

#### IsValidShortName Method

---

|  |
| --- |
| ExternalResourceServerUtils Class   See Also |

Checks whether the name is a valid short name for the external resource server.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static bool IsValidShortName( 	Guid serverId, 	string serverName ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function IsValidShortName ( _ 	serverId As Guid, _ 	serverName As String _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool IsValidShortName( 	Guid serverId,  	String^ serverName ) ``` |

#### Parameters

serverId
:   Type:  System Guid
     The id of the external resource server.

serverName
:   Type:  System String
     The short name of the external resource server.

#### Return Value

True if the name is a valid short name, false otherwise.

# Remarks

A valid short name should match the restrictions documented in  GetShortName  .

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExternalResourceServerUtils Class

Autodesk.Revit.DB Namespace

#### SetProfile Method

---

|  |
| --- |
| Truss Class   See Also |

Add or modify the profile of a truss.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetProfile( 	CurveArray topChords, 	CurveArray bottomChords ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetProfile ( _ 	topChords As CurveArray, _ 	bottomChords As CurveArray _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetProfile( 	CurveArray^ topChords,  	CurveArray^ bottomChords ) ``` |

#### Parameters

topChords
:   Type:  Autodesk.Revit.DB CurveArray
     The curves serving as top chords of the truss.

bottomChords
:   Type:  Autodesk.Revit.DB CurveArray
     The curves serving as bottom chords of the truss.

# See Also

Truss Class

Autodesk.Revit.DB.Structure Namespace

#### FabricationPartCannotChangeTypeError Property

---

|  |
| --- |
| BuiltInFailures MEPFabricationFailures Class   See Also |

The selected fitting(s) cannot successfully change the type. You must disconnect the connections on the fitting(s) and try again.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FabricationPartCannotChangeTypeError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FabricationPartCannotChangeTypeError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FabricationPartCannotChangeTypeError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures MEPFabricationFailures Class

Autodesk.Revit.DB Namespace

#### HasPhases Method

---

|  |
| --- |
| Element Class   See Also |

Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool HasPhases() ``` |

| Visual Basic |
| --- |
| ``` Public Function HasPhases As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool HasPhases() ``` |

#### Return Value

True if this Element has the properties CreatedPhaseId and DemolishedPhaseId, false otherwise.

# Remarks

Acts as a validator for setting the properties CreatedPhaseId and DemolishedPhaseId.

# See Also

Element Class

Autodesk.Revit.DB Namespace

#### Clear Method

---

|  |
| --- |
| ExportLayerTable Class   See Also |

Removes all contents stored in the table.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public void Clear() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Clear ``` |

| Visual C++ |
| --- |
| ``` public: void Clear() ``` |

# See Also

ExportLayerTable Class

Autodesk.Revit.DB Namespace

#### IsEmbedded Property

---

|  |
| --- |
| ScheduleDefinition Class   See Also |

Indicates if this is an embedded ScheduleDefinition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool IsEmbedded { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsEmbedded As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsEmbedded { 	bool get (); } ``` |

# See Also

ScheduleDefinition Class

Autodesk.Revit.DB Namespace

#### ReferenceCategoryId Property

---

|  |
| --- |
| MultiReferenceAnnotationType Class   See Also |

The category of elements to which this annotation applies.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public ElementId ReferenceCategoryId { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ReferenceCategoryId As ElementId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ ReferenceCategoryId { 	ElementId^ get (); } ``` |

# Remarks

The TagTypeId will be cleared because the user must set a new tag type of an appropriate category.

# See Also

MultiReferenceAnnotationType Class

Autodesk.Revit.DB Namespace

#### CouldNotAcquireAssemblyViews Property

---

|  |
| --- |
| BuiltInFailures AssemblyFailures Class   See Also |

The assembly instance could not acquire the assembly views.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId CouldNotAcquireAssemblyViews { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CouldNotAcquireAssemblyViews As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ CouldNotAcquireAssemblyViews { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AssemblyFailures Class

Autodesk.Revit.DB Namespace

#### Create Method

---

|  |
| --- |
| Material Class   Example   See Also |

Creates a new material.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ElementId Create( 	Document document, 	string name ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	document As Document, _ 	name As String _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ Create( 	Document^ document,  	String^ name ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The document in which to create the material.

name
:   Type:  System String
     The name of the new material.

#### Return Value

Identifier of the new material.

# Examples

 Copy  C#

```
//Create the material
ElementId materialId = Material.Create(document, "My Material");
Material material = document.GetElement(materialId) as Material;

//Create a new property set that can be used by this material
StructuralAsset strucAsset = new StructuralAsset("My Property Set", StructuralAssetClass.Concrete);
strucAsset.Behavior = StructuralBehavior.Isotropic;
strucAsset.Density = 232.0;

//Assign the property set to the material.
PropertySetElement pse = PropertySetElement.Create(document, strucAsset);
material.SetMaterialAspectByPropertySet(MaterialAspect.Structural, pse.Id);
```

 Copy  VB.NET

```
'Create the material
Dim materialId As ElementId = Material.Create(document, "My Material")
Dim material__1 As Material = TryCast(document.GetElement(materialId), Material)

'Create a new property set that can be used by this material
Dim strucAsset As New StructuralAsset("My Property Set", StructuralAssetClass.Concrete)
strucAsset.Behavior = StructuralBehavior.Isotropic
strucAsset.Density = 232.0

'Assign the property set to the material.
Dim pse As PropertySetElement = PropertySetElement.Create(document, strucAsset)
material__1.SetMaterialAspectByPropertySet(MaterialAspect.Structural, pse.Id)
```

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- The given value for name is already in use as a material element name. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

Material Class

Autodesk.Revit.DB Namespace

#### HideWhenNoValue Property

---

|  |
| --- |
| ExternalDefinition Class   See Also |

Indicates whether this parameter should be hidden from the properties palette when it has no value.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public bool HideWhenNoValue { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property HideWhenNoValue As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool HideWhenNoValue { 	bool get (); 	void set (bool value); } ``` |

#### Field Value

If true, the parameter will be hidden from the properties palette when it has no value. If false, the parameter will always be shown in the properties palette, no matter if it has a value or not.

# Remarks

Even when hidden, the parameter can still be accessed directly via the API.

# See Also

ExternalDefinition Class

Autodesk.Revit.DB Namespace

#### PrinterResolution Enumeration

---

|  |
| --- |
| See Also |

Controls the resolution level in rendering settings.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum PrinterResolution ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PrinterResolution ``` |

| Visual C++ |
| --- |
| ``` public enum class PrinterResolution ``` |

# Members

| Member name | Description |
| --- | --- |
| Low | Low printer resolution. |
| Medium | Medium printer resolution. |
| High | High printer resolution. |
| VeryHigh | VeryHigh printer resolution. |

# Remarks

It is applicable only when using printer resolution. The suitable resolution value for each resolution level is decided by default in Revit.

# See Also

Autodesk.Revit.DB Namespace

#### CheckBuildingType Method

---

|  |
| --- |
| EnergyDataSettings Class   See Also |

Checks that the building type falls within an appropriate range.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public static bool CheckBuildingType( 	gbXMLBuildingType buildingType ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function CheckBuildingType ( _ 	buildingType As gbXMLBuildingType _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool CheckBuildingType( 	gbXMLBuildingType buildingType ) ``` |

#### Parameters

buildingType
:   Type:  Autodesk.Revit.DB.Analysis gbXMLBuildingType
     The building type to be checked.

#### Return Value

True if the building type falls within an appropriate range, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### SetWriteAccessLevel Method

---

|  |
| --- |
| SchemaBuilder Class   See Also |

Sets top level write access (for entities)

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public SchemaBuilder SetWriteAccessLevel( 	AccessLevel writeAccessLevel ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetWriteAccessLevel ( _ 	writeAccessLevel As AccessLevel _ ) As SchemaBuilder ``` |

| Visual C++ |
| --- |
| ``` public: SchemaBuilder^ SetWriteAccessLevel( 	AccessLevel writeAccessLevel ) ``` |

#### Parameters

writeAccessLevel
:   Type:  Autodesk.Revit.DB.ExtensibleStorage AccessLevel
     Write access level value to be set

#### Return Value

The SchemaBuilder object may be used to add more settings.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions InvalidOperationException | The SchemaBuilder has already finished building the Schema. |

# See Also

SchemaBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### GetEnumerator Method

---

|  |
| --- |
| IFCAggregate Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator<IFCData> GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator(Of IFCData) ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator<IFCData^>^ GetEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable T GetEnumerator

# See Also

IFCAggregate Class

Autodesk.Revit.DB.IFC Namespace

#### RefreshActiveView Method

---

|  |
| --- |
| UIDocument Class   See Also |

Refresh the display of the active view in the active document.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public void RefreshActiveView() ``` |

| Visual Basic |
| --- |
| ``` Public Sub RefreshActiveView ``` |

| Visual C++ |
| --- |
| ``` public: void RefreshActiveView() ``` |

# See Also

UIDocument Class

Autodesk.Revit.UI Namespace

#### ApplicableSegmentLengthRounding Property

---

|  |
| --- |
| FabricRoundingManager Class   See Also |

The applicable rounding for fabric segments.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public double ApplicableSegmentLengthRounding { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ApplicableSegmentLengthRounding As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double ApplicableSegmentLengthRounding { 	double get (); } ``` |

# Remarks

IsActiveOnElement property of ReinforcementSettings RebarRoundingManager has to be true. ApplicableSegmentLengthRounding is meaningless if ReinforcementSettings RebarRoundingManager IsActiveOnElement is false.

# See Also

FabricRoundingManager Class

Autodesk.Revit.DB.Structure Namespace